----------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  dtalink_example
       log:  C:\Users\kkranker\Documents\Stata\dtalink\code-dtalink\dtalink_example.log
  log type:  text
 opened on:   9 Sep 2019, 16:45:51

. 
. *! dtalink_example.do
. *! Probabilistic record linkage routine - examples
. *!
. *! This progam shows how the dtalink command might be used.
. *!
. *! By Keith Kranker
. *
. * Copyright (C) Mathematica Policy Research, Inc. This code cannot be copied, distributed or used without the express written permission of Mathematica Policy
>  Research, Inc.
. 
. pwd
C:\Users\kkranker\Documents\Stata\dtalink\code-dtalink

. which dtalink
.\dtalink.ado
*! dtalink.ado
*! Probabilistic record linkage or deduplication
*! By Keith Kranker
*! Mata Source Code
*! Defines classes which are called by dtalink.ado
*! dtalink is the parent class and includes shared functions
*! dtalink is used for deduplicating 1 file
*! dtalink2 extends dtalink for the case of linking 2 files
*! some functions in dtalink are replaced in the derived class, dtatlink2

. set processors `c(processors_max)'
    The maximum number of processors or cores being used is 4.  It can be set to any number between 1 and 4.

. 
. 
. ***************************************
. * Examples w/ baseball players
. ***************************************
. 
. input byte id str8 first str6 middle str9 last byte yankee byte file

           id      first     middle       last    yankee      file
  1.  1 "M." "" "Mantle" 1 0
  2.  1 "Mickey" "" "Mantle" 1 0
  3.  1 "Mickey" "" "Mantle" 1 0
  4.  2 "Henry" "Louis" "Gehrig" 1 0
  5.  2 "Lou" "" "Gehrig" 1 0
  6.  3 "Babe" "" "Ruth" 1 0
  7.  3 "George" "Herman" "Ruth, Jr." 1 0
  8.  3 "George" "Herman" "Ruth" 0 0
  9.  4 "Ted" "" "Williams" 0 0
 10.  4 "Theodore" "Samuel" "Williams" 0 0
 11.  5 "William" "Ted" "Cox" 0 0
 12.  5 "Ted" "" "Cox" 0 0
 13.  6 "Stan" "" "Williams" 0 0
 14.  7 "M." "" "Mantle" 1 1
 15.  7 "Mickey" "" "Mantle" 1 1
 16.  8 "Henry" "Louis" "Gehrig" 1 1
 17.  8 "Lou" "" "Gehrig" 1 1
 18.  9 "Babe" "" "Ruth" 1 1
 19.  9 "Babe" "" "Ruth, Jr" 1 1
 20.  9 "George" "Herman" "Ruth, Jr" 0 1
 21. 10 "Ted" "" "Williams" 0 1
 22. 10 "Theodore" "Samuel" "Williams" 0 1
 23. 11 "William" "Ted" "Cox" 0 1
 24. 11 "Ted" "" "Cox" 0 1
 25. 12 "Stan" "" "Williams" 0 1
 26. end

. 
. bys  file (id): list, sepby(id) noobs

----------------------------------------------------------------------------------------------------------------------------------------------------------------
-> file = 0

  +----------------------------------------------------+
  | id      first   middle        last   yankee   file |
  |----------------------------------------------------|
  |  1         M.               Mantle        1      0 |
  |  1     Mickey               Mantle        1      0 |
  |  1     Mickey               Mantle        1      0 |
  |----------------------------------------------------|
  |  2      Henry    Louis      Gehrig        1      0 |
  |  2        Lou               Gehrig        1      0 |
  |----------------------------------------------------|
  |  3       Babe                 Ruth        1      0 |
  |  3     George   Herman   Ruth, Jr.        1      0 |
  |  3     George   Herman        Ruth        0      0 |
  |----------------------------------------------------|
  |  4        Ted             Williams        0      0 |
  |  4   Theodore   Samuel    Williams        0      0 |
  |----------------------------------------------------|
  |  5    William      Ted         Cox        0      0 |
  |  5        Ted                  Cox        0      0 |
  |----------------------------------------------------|
  |  6       Stan             Williams        0      0 |
  +----------------------------------------------------+

----------------------------------------------------------------------------------------------------------------------------------------------------------------
-> file = 1

  +---------------------------------------------------+
  | id      first   middle       last   yankee   file |
  |---------------------------------------------------|
  |  7         M.              Mantle        1      1 |
  |  7     Mickey              Mantle        1      1 |
  |---------------------------------------------------|
  |  8      Henry    Louis     Gehrig        1      1 |
  |  8        Lou              Gehrig        1      1 |
  |---------------------------------------------------|
  |  9       Babe                Ruth        1      1 |
  |  9       Babe            Ruth, Jr        1      1 |
  |  9     George   Herman   Ruth, Jr        0      1 |
  |---------------------------------------------------|
  | 10        Ted            Williams        0      1 |
  | 10   Theodore   Samuel   Williams        0      1 |
  |---------------------------------------------------|
  | 11    William      Ted        Cox        0      1 |
  | 11        Ted                 Cox        0      1 |
  |---------------------------------------------------|
  | 12       Stan            Williams        0      1 |
  +---------------------------------------------------+


. preserve

. 
. // basic dedup
. drop id file

. dtalink first 3 -3 middle 3 -1 last 8 -5 yankee 0 -1, cutoff(4) examples(16) describe

----------------------------------------------------------------------------
Usage type and variable  |
name                     |    Match weight  No match weight          Caliper
-------------------------+--------------------------------------------------
Blocking variables       |
                  (None) |                                                 0
-------------------------+--------------------------------------------------
Exact matching variables |
                   first |               3               -3                0
                    last |               8               -5                0
                  middle |               3               -1                0
                  yankee |               0               -1                0
----------------------------------------------------------------------------
  41 matches were found.

Distribution of matched pair scores, among pairs with score >=4:

Probabilist |
ic matching |
      score |      Freq.
------------+------------+-----------------------------------------------------
       4.00 |          3 |***
       5.00 |         26 |**************************
      11.00 |          9 |*********
      14.00 |          3 |***
------------+------------+-----------------------------------------------------
      Total |         41 
The current configuration of the data is: one row per record.


Description of the new dataset:

Contains data
  obs:            83                          
 vars:             8                          
 size:         2,573                          
----------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
----------------------------------------------------------------------------------------------------------------------------------------------------------------
_matchID        byte    %10.0g                Matched set identifier
_id             float   %9.0g                 Row number in original data file
_score          byte    %9.2f                 Probabilistic matching score
_matchflag      byte    %11.0g     _mtchflg   Match indicator
first           str8    %9s                   
middle          str6    %9s                   
last            str9    %9s                   
yankee          byte    %8.0g                 
----------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: _matchID  _id  first  middle  last  yankee
     Note: Dataset has changed since last saved.

Examples (up to 16 rows):

     +------------------------------------------------------------------------+
     | _matchID   _id   _score   _match~g    first   middle     last   yankee |
     |------------------------------------------------------------------------|
  1. |        1     1     5.00    Matched       M.            Mantle        1 |
  2. |        1     2     5.00    Matched   Mickey            Mantle        1 |
     |------------------------------------------------------------------------|
  3. |        2     1     5.00    Matched       M.            Mantle        1 |
  4. |        2     3     5.00    Matched   Mickey            Mantle        1 |
     |------------------------------------------------------------------------|
  5. |        3     1    11.00    Matched       M.            Mantle        1 |
  6. |        3    14    11.00    Matched       M.            Mantle        1 |
     |------------------------------------------------------------------------|
  7. |        4     1     5.00    Matched       M.            Mantle        1 |
  8. |        4    15     5.00    Matched   Mickey            Mantle        1 |
     |------------------------------------------------------------------------|
  9. |        5     2    11.00    Matched   Mickey            Mantle        1 |
 10. |        5     3    11.00    Matched   Mickey            Mantle        1 |
     |------------------------------------------------------------------------|
 11. |        6     2     5.00    Matched   Mickey            Mantle        1 |
 12. |        6    14     5.00    Matched       M.            Mantle        1 |
     |------------------------------------------------------------------------|
 13. |        7     2    11.00    Matched   Mickey            Mantle        1 |
 14. |        7    15    11.00    Matched   Mickey            Mantle        1 |
     |------------------------------------------------------------------------|
 15. |        8     3     5.00    Matched   Mickey            Mantle        1 |
 16. |        8    14     5.00    Matched       M.            Mantle        1 |
     +------------------------------------------------------------------------+

. 
. // basic dedup - with id() variable and the "fillunmatched" option
. restore, preserve

. keep if file==0
(12 observations deleted)

. drop file

. dtalink first 3 -3 middle 3 -1 last 8 -5 yankee 0 -1, cutoff(4) id(id) fillunmatched describe examples(16)

----------------------------------------------------------------------------
Usage type and variable  |
name                     |    Match weight  No match weight          Caliper
-------------------------+--------------------------------------------------
Blocking variables       |
                  (None) |                                                 0
-------------------------+--------------------------------------------------
Exact matching variables |
                   first |               3               -3                0
                    last |               8               -5                0
                  middle |               3               -1                0
                  yankee |               0               -1                0
----------------------------------------------------------------------------
  1 match was found.

Distribution of matched pair scores, among pairs with score >=4:

Probabilist |
ic matching |
      score |      Freq.
------------+------------+-----------------------------------------------------
       5.00 |          1 |*
------------+------------+-----------------------------------------------------
      Total |          1 
The current configuration of the data is: one row per record.


Description of the new dataset:

Contains data
  obs:            13                          
 vars:             8                          
 size:           364                          
----------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
----------------------------------------------------------------------------------------------------------------------------------------------------------------
_matchID        byte    %10.0g                Matched set identifier
id              byte    %8.0g                 
_score          byte    %9.2f                 Probabilistic matching score
_matchflag      byte    %11.0g     _mtchflg   Match indicator
first           str8    %9s                   
middle          str6    %9s                   
last            str9    %9s                   
yankee          byte    %8.0g                 
----------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: _matchID  id  first  middle  last  yankee
     Note: Dataset has changed since last saved.

Examples (up to 16 rows):

     +---------------------------------------------------------------------------+
     | _matchID   id   _score   _match~g      first   middle       last   yankee |
     |---------------------------------------------------------------------------|
  1. |        1    4     5.00    Matched        Ted            Williams        0 |
  2. |        1    4     5.00    Matched   Theodore   Samuel   Williams        0 |
  3. |        1    6     5.00    Matched       Stan            Williams        0 |
     +---------------------------------------------------------------------------+

. cap nois list , sepby(_matchID)

     +-------------------------------------------------------------------------------+
     | _matchID   id   _score    _matchflag      first   middle        last   yankee |
     |-------------------------------------------------------------------------------|
  1. |        1    4     5.00       Matched        Ted             Williams        0 |
  2. |        1    4     5.00       Matched   Theodore   Samuel    Williams        0 |
  3. |        1    6     5.00       Matched       Stan             Williams        0 |
     |-------------------------------------------------------------------------------|
  4. |        2    1        .   Not matched         M.               Mantle        1 |
  5. |        2    1        .   Not matched     Mickey               Mantle        1 |
  6. |        2    1        .   Not matched     Mickey               Mantle        1 |
     |-------------------------------------------------------------------------------|
  7. |        3    2        .   Not matched      Henry    Louis      Gehrig        1 |
  8. |        3    2        .   Not matched        Lou               Gehrig        1 |
     |-------------------------------------------------------------------------------|
  9. |        4    3        .   Not matched       Babe                 Ruth        1 |
 10. |        4    3        .   Not matched     George   Herman        Ruth        0 |
 11. |        4    3        .   Not matched     George   Herman   Ruth, Jr.        1 |
     |-------------------------------------------------------------------------------|
 12. |        6    5        .   Not matched        Ted                  Cox        0 |
 13. |        6    5        .   Not matched    William      Ted         Cox        0 |
     +-------------------------------------------------------------------------------+

. 
. // same thing with one caliper matching variable
. restore, preserve

. tostring id , replace format(%03.0f)
id was byte now str3

. replace id = id + "XX"
variable id was str3 now str5
(25 real changes made)

. dtalink first 3 -3 middle 3 -1 last 8 -5 yankee 0 -1 1, cutoff(4) id(id) fillunmatched describe examples(16) calcweights

------------------------------------------------------------------------------
Usage type and variable    |
name                       |    Match weight  No match weight          Caliper
---------------------------+--------------------------------------------------
Blocking variables         |
                    (None) |                                                 0
---------------------------+--------------------------------------------------
Caliper matching variables |
                    yankee |               0               -1                1
---------------------------+--------------------------------------------------
Exact matching variables   |
                     first |               3               -3                0
                      last |               8               -5                0
                    middle |               3               -1                0
------------------------------------------------------------------------------
  10 matches were found.

Suggested matching weights:
-----------------------------------------------------------------------
                           | new_wgt_match  new_wgt_no_match    Caliper
---------------------------+-------------------------------------------
Caliper_matching_variables |
                    yankee |         0.000             0.000      1.000
---------------------------+-------------------------------------------
Exact_matching_variables   |
                     first |         3.636            -0.624          .
                    middle |         3.707            -0.158          .
                      last |      1022.000         -1022.000          .
-----------------------------------------------------------------------

Distribution of matched pair scores, among pairs with score >=4:

Probabilist |
ic matching |
      score |      Freq.
------------+------------+-----------------------------------------------------
       5.00 |          4 |****
      11.00 |          3 |***
      14.00 |          3 |***
------------+------------+-----------------------------------------------------
      Total |         10 
The current configuration of the data is: one row per record.


Description of the new dataset:

Contains data
  obs:            37                          
 vars:             9                          
 size:         1,221                          
----------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
----------------------------------------------------------------------------------------------------------------------------------------------------------------
_matchID        byte    %10.0g                Matched set identifier
id              str5    %9s                   
_score          byte    %9.2f                 Probabilistic matching score
_matchflag      byte    %11.0g     _mtchflg   Match indicator
first           str8    %9s                   
middle          str6    %9s                   
last            str9    %9s                   
yankee          byte    %8.0g                 
file            byte    %8.0g                 
----------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: _matchID  id  yankee  first  middle  last
     Note: Dataset has changed since last saved.

Examples (up to 16 rows):

     +--------------------------------------------------------------------------------------+
     | _matchID      id   _score   _match~g      first   middle        last   yankee   file |
     |--------------------------------------------------------------------------------------|
  1. |        1   001XX    11.00    Matched         M.               Mantle        1      0 |
  2. |        1   001XX    11.00    Matched     Mickey               Mantle        1      0 |
  3. |        1   001XX    11.00    Matched     Mickey               Mantle        1      0 |
  4. |        1   007XX    11.00    Matched         M.               Mantle        1      1 |
  5. |        1   007XX    11.00    Matched     Mickey               Mantle        1      1 |
     |--------------------------------------------------------------------------------------|
  6. |        2   002XX    14.00    Matched      Henry    Louis      Gehrig        1      0 |
  7. |        2   002XX    14.00    Matched        Lou               Gehrig        1      0 |
  8. |        2   008XX    14.00    Matched      Henry    Louis      Gehrig        1      1 |
  9. |        2   008XX    14.00    Matched        Lou               Gehrig        1      1 |
     |--------------------------------------------------------------------------------------|
 10. |        3   003XX    11.00    Matched     George   Herman        Ruth        0      0 |
 11. |        3   003XX    11.00    Matched       Babe                 Ruth        1      0 |
 12. |        3   003XX    11.00    Matched     George   Herman   Ruth, Jr.        1      0 |
 13. |        3   009XX    11.00    Matched     George   Herman    Ruth, Jr        0      1 |
 14. |        3   009XX    11.00    Matched       Babe                 Ruth        1      1 |
 15. |        3   009XX    11.00    Matched       Babe             Ruth, Jr        1      1 |
     |--------------------------------------------------------------------------------------|
 16. |        4   004XX     5.00    Matched        Ted             Williams        0      0 |
 17. |        4   004XX     5.00    Matched   Theodore   Samuel    Williams        0      0 |
 18. |        4   006XX     5.00    Matched       Stan             Williams        0      0 |
     +--------------------------------------------------------------------------------------+

. cap nois list , sepby(_matchID)

     +--------------------------------------------------------------------------------------+
     | _matchID      id   _score   _match~g      first   middle        last   yankee   file |
     |--------------------------------------------------------------------------------------|
  1. |        1   001XX    11.00    Matched         M.               Mantle        1      0 |
  2. |        1   001XX    11.00    Matched     Mickey               Mantle        1      0 |
  3. |        1   001XX    11.00    Matched     Mickey               Mantle        1      0 |
  4. |        1   007XX    11.00    Matched         M.               Mantle        1      1 |
  5. |        1   007XX    11.00    Matched     Mickey               Mantle        1      1 |
     |--------------------------------------------------------------------------------------|
  6. |        2   002XX    14.00    Matched      Henry    Louis      Gehrig        1      0 |
  7. |        2   002XX    14.00    Matched        Lou               Gehrig        1      0 |
  8. |        2   008XX    14.00    Matched      Henry    Louis      Gehrig        1      1 |
  9. |        2   008XX    14.00    Matched        Lou               Gehrig        1      1 |
     |--------------------------------------------------------------------------------------|
 10. |        3   003XX    11.00    Matched     George   Herman        Ruth        0      0 |
 11. |        3   003XX    11.00    Matched       Babe                 Ruth        1      0 |
 12. |        3   003XX    11.00    Matched     George   Herman   Ruth, Jr.        1      0 |
 13. |        3   009XX    11.00    Matched     George   Herman    Ruth, Jr        0      1 |
 14. |        3   009XX    11.00    Matched       Babe                 Ruth        1      1 |
 15. |        3   009XX    11.00    Matched       Babe             Ruth, Jr        1      1 |
     |--------------------------------------------------------------------------------------|
 16. |        4   004XX     5.00    Matched        Ted             Williams        0      0 |
 17. |        4   004XX     5.00    Matched   Theodore   Samuel    Williams        0      0 |
 18. |        4   006XX     5.00    Matched       Stan             Williams        0      0 |
     |--------------------------------------------------------------------------------------|
 19. |        5   004XX    14.00    Matched        Ted             Williams        0      0 |
 20. |        5   004XX    14.00    Matched   Theodore   Samuel    Williams        0      0 |
 21. |        5   010XX    14.00    Matched        Ted             Williams        0      1 |
 22. |        5   010XX    14.00    Matched   Theodore   Samuel    Williams        0      1 |
     |--------------------------------------------------------------------------------------|
 23. |        6   004XX     5.00    Matched        Ted             Williams        0      0 |
 24. |        6   004XX     5.00    Matched   Theodore   Samuel    Williams        0      0 |
 25. |        6   012XX     5.00    Matched       Stan             Williams        0      1 |
     |--------------------------------------------------------------------------------------|
 26. |        7   005XX    14.00    Matched        Ted                  Cox        0      0 |
 27. |        7   005XX    14.00    Matched    William      Ted         Cox        0      0 |
 28. |        7   011XX    14.00    Matched        Ted                  Cox        0      1 |
 29. |        7   011XX    14.00    Matched    William      Ted         Cox        0      1 |
     |--------------------------------------------------------------------------------------|
 30. |        8   006XX    11.00    Matched       Stan             Williams        0      0 |
 31. |        8   012XX    11.00    Matched       Stan             Williams        0      1 |
     |--------------------------------------------------------------------------------------|
 32. |        9   006XX     5.00    Matched       Stan             Williams        0      0 |
 33. |        9   010XX     5.00    Matched        Ted             Williams        0      1 |
 34. |        9   010XX     5.00    Matched   Theodore   Samuel    Williams        0      1 |
     |--------------------------------------------------------------------------------------|
 35. |       10   010XX     5.00    Matched        Ted             Williams        0      1 |
 36. |       10   010XX     5.00    Matched   Theodore   Samuel    Williams        0      1 |
 37. |       10   012XX     5.00    Matched       Stan             Williams        0      1 |
     +--------------------------------------------------------------------------------------+

. return list

scalars:
         r(scores_max) =  14
         r(scores_min) =  5
          r(scores_sd) =  4.06201920231798
        r(scores_mean) =  9.5
           r(pairsnum) =  10
                  r(N) =  24
          r(misscheck) =  1
             r(cutoff) =  4
           r(numfiles) =  1

macros:
      r(new_wgt_specs) : "first 3.636203 -.6237977 middle 3.706592 -.1575942 last 1022 -1022 yankee 0 0 1"
          r(dstnegwgt) : "-1"
          r(dstposwgt) : "0"
           r(dstradii) : "1"
            r(dstvars) : "yankee"
          r(mtcnegwgt) : "-3 -1 -5"
          r(mtcposwgt) : "3 3 8"
            r(mtcvars) : "first middle last"
              r(idvar) : "id"
            r(cmdline) : "dtalink first 3 -3 middle 3 -1 last 8 -5 yankee 0 -1 1, cutoff(4) id(id) fillunmatched describe examples(16) calcweights"
                r(cmd) : "dtalink"

matrices:
        r(new_weights) :  4 x 3
     r(new_dst_negwgt) :  1 x 1
     r(new_dst_poswgt) :  1 x 1
     r(new_mtc_negwgt) :  3 x 1
     r(new_mtc_poswgt) :  3 x 1

. 
. // dedup where we keep only the "best" _matchid for each id --- notice that we no longer have matches between 4 and 6, 4 and 10, 4 and 12, or 10 and 12
. restore, preserve

. drop file

. dtalink first 3 -3 middle 3 -1 last 8 -5 yankee 0 -1, cutoff(4) id(id) bestmatch noweight
  10 matches were found.
  Keeping best match for each id
  (3 pairs deleted.)

Distribution of matched pair scores, among pairs with score >=4:

Probabilist |
ic matching |
      score |      Freq.
------------+------------+-----------------------------------------------------
       5.00 |          1 |*
      11.00 |          3 |***
      14.00 |          3 |***
------------+------------+-----------------------------------------------------
      Total |          7 
The current configuration of the data is: one row per record.

. list , sepby(_matchID)

     +----------------------------------------------------------------------------+
     | _matchID   id   _score   _match~g      first   middle        last   yankee |
     |----------------------------------------------------------------------------|
  1. |        1    1    11.00    Matched         M.               Mantle        1 |
  2. |        1    1    11.00    Matched     Mickey               Mantle        1 |
  3. |        1    1    11.00    Matched     Mickey               Mantle        1 |
  4. |        1    7    11.00    Matched         M.               Mantle        1 |
  5. |        1    7    11.00    Matched     Mickey               Mantle        1 |
     |----------------------------------------------------------------------------|
  6. |        2    2    14.00    Matched      Henry    Louis      Gehrig        1 |
  7. |        2    2    14.00    Matched        Lou               Gehrig        1 |
  8. |        2    8    14.00    Matched      Henry    Louis      Gehrig        1 |
  9. |        2    8    14.00    Matched        Lou               Gehrig        1 |
     |----------------------------------------------------------------------------|
 10. |        3    3    11.00    Matched       Babe                 Ruth        1 |
 11. |        3    3    11.00    Matched     George   Herman        Ruth        0 |
 12. |        3    3    11.00    Matched     George   Herman   Ruth, Jr.        1 |
 13. |        3    9    11.00    Matched       Babe                 Ruth        1 |
 14. |        3    9    11.00    Matched       Babe             Ruth, Jr        1 |
 15. |        3    9    11.00    Matched     George   Herman    Ruth, Jr        0 |
     |----------------------------------------------------------------------------|
 16. |        5    4    14.00    Matched        Ted             Williams        0 |
 17. |        5    4    14.00    Matched   Theodore   Samuel    Williams        0 |
 18. |        5   10    14.00    Matched        Ted             Williams        0 |
 19. |        5   10    14.00    Matched   Theodore   Samuel    Williams        0 |
     |----------------------------------------------------------------------------|
 20. |        7    5    14.00    Matched        Ted                  Cox        0 |
 21. |        7    5    14.00    Matched    William      Ted         Cox        0 |
 22. |        7   11    14.00    Matched        Ted                  Cox        0 |
 23. |        7   11    14.00    Matched    William      Ted         Cox        0 |
     |----------------------------------------------------------------------------|
 24. |        8    6    11.00    Matched       Stan             Williams        0 |
 25. |        8   12    11.00    Matched       Stan             Williams        0 |
     |----------------------------------------------------------------------------|
 26. |        9    6     5.00    Matched       Stan             Williams        0 |
 27. |        9   10     5.00    Matched        Ted             Williams        0 |
 28. |        9   10     5.00    Matched   Theodore   Samuel    Williams        0 |
     +----------------------------------------------------------------------------+

. 
. // dedup with "combined" matched sets ---  notice that 4, 6, 10, and 12 are now in a single matched set
. restore, preserve

. drop file

. dtalink first 3 -3 middle 3 -1 last 8 -5 yankee 0 -1, cutoff(4) id(id) combinesets noweight
  10 matches were found.
  (dtalink::combinesets required 1 iteration to achieve convergence)

Distribution of matched pair scores, among pairs with score >=4:

Probabilist |
ic matching |
      score |      Freq.
------------+------------+-----------------------------------------------------
       5.00 |          4 |****
      11.00 |          3 |***
      14.00 |          3 |***
------------+------------+-----------------------------------------------------
      Total |         10 
The current configuration of the data is: one row per record.

. list , sepby(_matchID)

     +----------------------------------------------------------------------------+
     | _matchID   id   _score   _match~g      first   middle        last   yankee |
     |----------------------------------------------------------------------------|
  1. |        1    1    11.00    Matched         M.               Mantle        1 |
  2. |        1    1    11.00    Matched     Mickey               Mantle        1 |
  3. |        1    1    11.00    Matched     Mickey               Mantle        1 |
  4. |        1    7    11.00    Matched         M.               Mantle        1 |
  5. |        1    7    11.00    Matched     Mickey               Mantle        1 |
     |----------------------------------------------------------------------------|
  6. |        2    2    14.00    Matched      Henry    Louis      Gehrig        1 |
  7. |        2    2    14.00    Matched        Lou               Gehrig        1 |
  8. |        2    8    14.00    Matched      Henry    Louis      Gehrig        1 |
  9. |        2    8    14.00    Matched        Lou               Gehrig        1 |
     |----------------------------------------------------------------------------|
 10. |        3    3    11.00    Matched       Babe                 Ruth        1 |
 11. |        3    3    11.00    Matched     George   Herman        Ruth        0 |
 12. |        3    3    11.00    Matched     George   Herman   Ruth, Jr.        1 |
 13. |        3    9    11.00    Matched       Babe                 Ruth        1 |
 14. |        3    9    11.00    Matched       Babe             Ruth, Jr        1 |
 15. |        3    9    11.00    Matched     George   Herman    Ruth, Jr        0 |
     |----------------------------------------------------------------------------|
 16. |        4    4    14.00    Matched        Ted             Williams        0 |
 17. |        4    4    14.00    Matched   Theodore   Samuel    Williams        0 |
 18. |        4    6    11.00    Matched       Stan             Williams        0 |
 19. |        4   10    14.00    Matched        Ted             Williams        0 |
 20. |        4   10    14.00    Matched   Theodore   Samuel    Williams        0 |
 21. |        4   12    11.00    Matched       Stan             Williams        0 |
     |----------------------------------------------------------------------------|
 22. |        7    5    14.00    Matched        Ted                  Cox        0 |
 23. |        7    5    14.00    Matched    William      Ted         Cox        0 |
 24. |        7   11    14.00    Matched        Ted                  Cox        0 |
 25. |        7   11    14.00    Matched    William      Ted         Cox        0 |
     +----------------------------------------------------------------------------+

. 
. // dedup with  ties
. restore, preserve

. drop file

. dtalink first 3 -3 middle 3 -3 last 3 -3 yankee 3 -3, cutoff(4) id(id) bestmatch noweight ties
  6 matches were found.
  Keeping best match for each id (keeping ties)
  (0 pairs deleted.)

Distribution of matched pair scores, among pairs with score >=4:

Probabilist |
ic matching |
      score |      Freq.
------------+------------+-----------------------------------------------------
       9.00 |          3 |***
      12.00 |          3 |***
------------+------------+-----------------------------------------------------
      Total |          6 
The current configuration of the data is: one row per record.

. list , sepby(_matchID)

     +----------------------------------------------------------------------------+
     | _matchID   id   _score   _match~g      first   middle        last   yankee |
     |----------------------------------------------------------------------------|
  1. |        1    1     9.00    Matched         M.               Mantle        1 |
  2. |        1    1     9.00    Matched     Mickey               Mantle        1 |
  3. |        1    1     9.00    Matched     Mickey               Mantle        1 |
  4. |        1    7     9.00    Matched         M.               Mantle        1 |
  5. |        1    7     9.00    Matched     Mickey               Mantle        1 |
     |----------------------------------------------------------------------------|
  6. |        2    2    12.00    Matched      Henry    Louis      Gehrig        1 |
  7. |        2    2    12.00    Matched        Lou               Gehrig        1 |
  8. |        2    8    12.00    Matched      Henry    Louis      Gehrig        1 |
  9. |        2    8    12.00    Matched        Lou               Gehrig        1 |
     |----------------------------------------------------------------------------|
 10. |        3    3     9.00    Matched       Babe                 Ruth        1 |
 11. |        3    3     9.00    Matched     George   Herman        Ruth        0 |
 12. |        3    3     9.00    Matched     George   Herman   Ruth, Jr.        1 |
 13. |        3    9     9.00    Matched       Babe                 Ruth        1 |
 14. |        3    9     9.00    Matched       Babe             Ruth, Jr        1 |
 15. |        3    9     9.00    Matched     George   Herman    Ruth, Jr        0 |
     |----------------------------------------------------------------------------|
 16. |        4    4    12.00    Matched        Ted             Williams        0 |
 17. |        4    4    12.00    Matched   Theodore   Samuel    Williams        0 |
 18. |        4   10    12.00    Matched        Ted             Williams        0 |
 19. |        4   10    12.00    Matched   Theodore   Samuel    Williams        0 |
     |----------------------------------------------------------------------------|
 20. |        5    5    12.00    Matched        Ted                  Cox        0 |
 21. |        5    5    12.00    Matched    William      Ted         Cox        0 |
 22. |        5   11    12.00    Matched        Ted                  Cox        0 |
 23. |        5   11    12.00    Matched    William      Ted         Cox        0 |
     |----------------------------------------------------------------------------|
 24. |        6    6     9.00    Matched       Stan             Williams        0 |
 25. |        6   12     9.00    Matched       Stan             Williams        0 |
     +----------------------------------------------------------------------------+

. 
. // dedup with  ties
. restore, preserve

. drop file

. dtalink first 3 -3 middle 3 -3 last 3 -3 yankee 3 -3, cutoff(4) id(id) bestmatch noweight ties  combinesets
  6 matches were found.
  Keeping best match for each id (keeping ties)
  (0 pairs deleted.)
  (dtalink::combinesets required 0 iteration to achieve convergence)

Distribution of matched pair scores, among pairs with score >=4:

Probabilist |
ic matching |
      score |      Freq.
------------+------------+-----------------------------------------------------
       9.00 |          3 |***
      12.00 |          3 |***
------------+------------+-----------------------------------------------------
      Total |          6 
The current configuration of the data is: one row per record.

. list , sepby(_matchID)

     +----------------------------------------------------------------------------+
     | _matchID   id   _score   _match~g      first   middle        last   yankee |
     |----------------------------------------------------------------------------|
  1. |        1    1     9.00    Matched         M.               Mantle        1 |
  2. |        1    1     9.00    Matched     Mickey               Mantle        1 |
  3. |        1    1     9.00    Matched     Mickey               Mantle        1 |
  4. |        1    7     9.00    Matched         M.               Mantle        1 |
  5. |        1    7     9.00    Matched     Mickey               Mantle        1 |
     |----------------------------------------------------------------------------|
  6. |        2    2    12.00    Matched      Henry    Louis      Gehrig        1 |
  7. |        2    2    12.00    Matched        Lou               Gehrig        1 |
  8. |        2    8    12.00    Matched      Henry    Louis      Gehrig        1 |
  9. |        2    8    12.00    Matched        Lou               Gehrig        1 |
     |----------------------------------------------------------------------------|
 10. |        3    3     9.00    Matched       Babe                 Ruth        1 |
 11. |        3    3     9.00    Matched     George   Herman        Ruth        0 |
 12. |        3    3     9.00    Matched     George   Herman   Ruth, Jr.        1 |
 13. |        3    9     9.00    Matched       Babe                 Ruth        1 |
 14. |        3    9     9.00    Matched       Babe             Ruth, Jr        1 |
 15. |        3    9     9.00    Matched     George   Herman    Ruth, Jr        0 |
     |----------------------------------------------------------------------------|
 16. |        4    4    12.00    Matched        Ted             Williams        0 |
 17. |        4    4    12.00    Matched   Theodore   Samuel    Williams        0 |
 18. |        4   10    12.00    Matched        Ted             Williams        0 |
 19. |        4   10    12.00    Matched   Theodore   Samuel    Williams        0 |
     |----------------------------------------------------------------------------|
 20. |        5    5    12.00    Matched        Ted                  Cox        0 |
 21. |        5    5    12.00    Matched    William      Ted         Cox        0 |
 22. |        5   11    12.00    Matched        Ted                  Cox        0 |
 23. |        5   11    12.00    Matched    William      Ted         Cox        0 |
     |----------------------------------------------------------------------------|
 24. |        6    6     9.00    Matched       Stan             Williams        0 |
 25. |        6   12     9.00    Matched       Stan             Williams        0 |
     +----------------------------------------------------------------------------+

. 
. 
. // basic dedup - wide format
. restore, preserve

. keep if file==0
(12 observations deleted)

. drop file id

. dtalink first 3 -3 middle 3 -1 last 8 -5 yankee 0 -1, cutoff(4) wide nomerge describe examples(16)

----------------------------------------------------------------------------
Usage type and variable  |
name                     |    Match weight  No match weight          Caliper
-------------------------+--------------------------------------------------
Blocking variables       |
                  (None) |                                                 0
-------------------------+--------------------------------------------------
Exact matching variables |
                   first |               3               -3                0
                    last |               8               -5                0
                  middle |               3               -1                0
                  yankee |               0               -1                0
----------------------------------------------------------------------------
  9 matches were found.

Distribution of matched pair scores, among pairs with score >=4:

Probabilist |
ic matching |
      score |      Freq.
------------+------------+-----------------------------------------------------
       4.00 |          1 |*
       5.00 |          7 |*******
      11.00 |          1 |*
------------+------------+-----------------------------------------------------
      Total |          9 
The current configuration of the data is: one row per matched pair.


Description of the new dataset:

Contains data
  obs:             9                          
 vars:             5                          
 size:            45                          
----------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
----------------------------------------------------------------------------------------------------------------------------------------------------------------
_matchID        byte    %10.0g                Matched set identifier
_id0            byte    %9.0g                 Row number in original data file
_id1            byte    %9.0g                 Row number in original data file
_score          byte    %9.2f                 Probabilistic matching score
_matchflag      byte    %11.0g     _mtchflg   Match indicator
----------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

Examples (up to 16 rows):

     +--------------------------------------------+
     | _matchID   _id0   _id1   _score   _match~g |
     |--------------------------------------------|
  1. |        1      1      2     5.00    Matched |
  2. |        2      1      3     5.00    Matched |
     |--------------------------------------------|
  3. |        3      2      3    11.00    Matched |
     |--------------------------------------------|
  4. |        4      4      5     5.00    Matched |
     |--------------------------------------------|
  5. |        5      6      8     4.00    Matched |
     |--------------------------------------------|
  6. |        6      9     10     5.00    Matched |
  7. |        7      9     13     5.00    Matched |
     |--------------------------------------------|
  8. |        8     10     13     5.00    Matched |
     |--------------------------------------------|
  9. |        9     11     12     5.00    Matched |
     +--------------------------------------------+

. 
. // basic dedup with blocks
. restore, preserve

. keep if file==0
(12 observations deleted)

. drop file id

. replace yankee = . in 4/5
(2 real changes made, 2 to missing)

. dtalink first 3 -3 middle 2 -1 last 6 -5 yankee 2 0, cutoff(3) block(yankee | last) describe examples(16)

----------------------------------------------------------------------------
Usage type and variable  |
name                     |    Match weight  No match weight          Caliper
-------------------------+--------------------------------------------------
Blocking variables       |
                last (1) |                                                 0
              yankee (1) |                                                 0
-------------------------+--------------------------------------------------
Exact matching variables |
                   first |               3               -3                0
                last (2) |               6               -5                0
                  middle |               2               -1                0
              yankee (2) |               2                0                0
----------------------------------------------------------------------------
Starting 2 blocks for blocking set 1 of 2: yankee. Each dot is 1 block.
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..
Starting 5 blocks for blocking set 2 of 2: last. Each dot is 1 block.
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
.....
  9 matches were found.

Distribution of matched pair scores, among pairs with score >=3:

Probabilist |
ic matching |
      score |      Freq.
------------+------------+-----------------------------------------------------
       3.00 |          2 |**
       5.00 |          6 |******
      11.00 |          1 |*
------------+------------+-----------------------------------------------------
      Total |          9 
The current configuration of the data is: one row per record.


Description of the new dataset:

Contains data
  obs:            19                          
 vars:             8                          
 size:           589                          
----------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
----------------------------------------------------------------------------------------------------------------------------------------------------------------
_matchID        byte    %10.0g                Matched set identifier
_id             float   %9.0g                 Row number in original data file
_score          byte    %9.2f                 Probabilistic matching score
_matchflag      byte    %11.0g     _mtchflg   Match indicator
first           str8    %9s                   
middle          str6    %9s                   
last            str9    %9s                   
yankee          byte    %8.0g                 
----------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: _matchID  _id  first  middle  last  yankee
     Note: Dataset has changed since last saved.

Examples (up to 16 rows):

     +----------------------------------------------------------------------------+
     | _matchID   _id   _score   _match~g      first   middle       last   yankee |
     |----------------------------------------------------------------------------|
  1. |        1     1     5.00    Matched         M.              Mantle        1 |
  2. |        1     2     5.00    Matched     Mickey              Mantle        1 |
     |----------------------------------------------------------------------------|
  3. |        2     1     5.00    Matched         M.              Mantle        1 |
  4. |        2     3     5.00    Matched     Mickey              Mantle        1 |
     |----------------------------------------------------------------------------|
  5. |        3     2    11.00    Matched     Mickey              Mantle        1 |
  6. |        3     3    11.00    Matched     Mickey              Mantle        1 |
     |----------------------------------------------------------------------------|
  7. |        4     4     3.00    Matched      Henry    Louis     Gehrig        . |
  8. |        4     5     3.00    Matched        Lou              Gehrig        . |
     |----------------------------------------------------------------------------|
  9. |        5     6     3.00    Matched       Babe                Ruth        1 |
 10. |        5     8     3.00    Matched     George   Herman       Ruth        0 |
     |----------------------------------------------------------------------------|
 11. |        6     9     5.00    Matched        Ted            Williams        0 |
 12. |        6    10     5.00    Matched   Theodore   Samuel   Williams        0 |
     |----------------------------------------------------------------------------|
 13. |        7     9     5.00    Matched        Ted            Williams        0 |
 14. |        7    13     5.00    Matched       Stan            Williams        0 |
     |----------------------------------------------------------------------------|
 15. |        8    10     5.00    Matched   Theodore   Samuel   Williams        0 |
 16. |        8    13     5.00    Matched       Stan            Williams        0 |
     +----------------------------------------------------------------------------+

. 
. // basic merge
. restore, preserve

. drop id

. dtalink first 3 -3 middle 3 -1 last 8 -5 yankee 2 0, cutoff(3) source(file) describe

----------------------------------------------------------------------------
Usage type and variable  |
name                     |    Match weight  No match weight          Caliper
-------------------------+--------------------------------------------------
Blocking variables       |
                  (None) |                                                 0
-------------------------+--------------------------------------------------
Exact matching variables |
                   first |               3               -3                0
                    last |               8               -5                0
                  middle |               3               -1                0
                  yankee |               2                0                0
----------------------------------------------------------------------------
  26 matches were found.

Distribution of matched pair scores, among pairs with score >=3:

Probabilist |
ic matching |
      score |      Freq.
------------+------------+-----------------------------------------------------
       3.00 |          1 |*
       5.00 |          1 |*
       7.00 |         13 |*************
      13.00 |          8 |********
      16.00 |          3 |***
------------+------------+-----------------------------------------------------
      Total |         26 
The current configuration of the data is: one row per record.


Description of the new dataset:

Contains data
  obs:            54                          
 vars:             9                          
 size:         1,728                          
----------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
----------------------------------------------------------------------------------------------------------------------------------------------------------------
_matchID        byte    %10.0g                Matched set identifier
file            byte    %8.0g                 
_id             float   %9.0g                 Row number in original data file
_score          byte    %9.2f                 Probabilistic matching score
_matchflag      byte    %11.0g     _mtchflg   Match indicator
first           str8    %9s                   
middle          str6    %9s                   
last            str9    %9s                   
yankee          byte    %8.0g                 
----------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: _matchID  file  _id  first  middle  last  yankee
     Note: Dataset has changed since last saved.

. gsort -_score _matchID file _id

. list, sepby(_matchID)

     +---------------------------------------------------------------------------------------+
     | _matchID   file   _id   _score    _matchflag      first   middle        last   yankee |
     |---------------------------------------------------------------------------------------|
  1. |        7      0     4    16.00       Matched      Henry    Louis      Gehrig        1 |
  2. |        7      1    16    16.00       Matched      Henry    Louis      Gehrig        1 |
     |---------------------------------------------------------------------------------------|
  3. |       18      0    10    16.00       Matched   Theodore   Samuel    Williams        0 |
  4. |       18      1    22    16.00       Matched   Theodore   Samuel    Williams        0 |
     |---------------------------------------------------------------------------------------|
  5. |       20      0    11    16.00       Matched    William      Ted         Cox        0 |
  6. |       20      1    23    16.00       Matched    William      Ted         Cox        0 |
     |---------------------------------------------------------------------------------------|
  7. |        1      0     1    13.00       Matched         M.               Mantle        1 |
  8. |        1      1    14    13.00       Matched         M.               Mantle        1 |
     |---------------------------------------------------------------------------------------|
  9. |        5      0     2    13.00       Matched     Mickey               Mantle        1 |
 10. |        5      1    15    13.00       Matched     Mickey               Mantle        1 |
     |---------------------------------------------------------------------------------------|
 11. |        6      0     3    13.00       Matched     Mickey               Mantle        1 |
 12. |        6      1    15    13.00       Matched     Mickey               Mantle        1 |
     |---------------------------------------------------------------------------------------|
 13. |       10      0     5    13.00       Matched        Lou               Gehrig        1 |
 14. |       10      1    17    13.00       Matched        Lou               Gehrig        1 |
     |---------------------------------------------------------------------------------------|
 15. |       11      0     6    13.00       Matched       Babe                 Ruth        1 |
 16. |       11      1    18    13.00       Matched       Babe                 Ruth        1 |
     |---------------------------------------------------------------------------------------|
 17. |       14      0     9    13.00       Matched        Ted             Williams        0 |
 18. |       14      1    21    13.00       Matched        Ted             Williams        0 |
     |---------------------------------------------------------------------------------------|
 19. |       23      0    12    13.00       Matched        Ted                  Cox        0 |
 20. |       23      1    24    13.00       Matched        Ted                  Cox        0 |
     |---------------------------------------------------------------------------------------|
 21. |       26      0    13    13.00       Matched       Stan             Williams        0 |
 22. |       26      1    25    13.00       Matched       Stan             Williams        0 |
     |---------------------------------------------------------------------------------------|
 23. |        2      0     2     7.00       Matched     Mickey               Mantle        1 |
 24. |        2      1    14     7.00       Matched         M.               Mantle        1 |
     |---------------------------------------------------------------------------------------|
 25. |        3      0     3     7.00       Matched     Mickey               Mantle        1 |
 26. |        3      1    14     7.00       Matched         M.               Mantle        1 |
     |---------------------------------------------------------------------------------------|
 27. |        4      0     1     7.00       Matched         M.               Mantle        1 |
 28. |        4      1    15     7.00       Matched     Mickey               Mantle        1 |
     |---------------------------------------------------------------------------------------|
 29. |        8      0     5     7.00       Matched        Lou               Gehrig        1 |
 30. |        8      1    16     7.00       Matched      Henry    Louis      Gehrig        1 |
     |---------------------------------------------------------------------------------------|
 31. |        9      0     4     7.00       Matched      Henry    Louis      Gehrig        1 |
 32. |        9      1    17     7.00       Matched        Lou               Gehrig        1 |
     |---------------------------------------------------------------------------------------|
 33. |       15      0    10     7.00       Matched   Theodore   Samuel    Williams        0 |
 34. |       15      1    21     7.00       Matched        Ted             Williams        0 |
     |---------------------------------------------------------------------------------------|
 35. |       16      0    13     7.00       Matched       Stan             Williams        0 |
 36. |       16      1    21     7.00       Matched        Ted             Williams        0 |
     |---------------------------------------------------------------------------------------|
 37. |       17      0     9     7.00       Matched        Ted             Williams        0 |
 38. |       17      1    22     7.00       Matched   Theodore   Samuel    Williams        0 |
     |---------------------------------------------------------------------------------------|
 39. |       19      0    13     7.00       Matched       Stan             Williams        0 |
 40. |       19      1    22     7.00       Matched   Theodore   Samuel    Williams        0 |
     |---------------------------------------------------------------------------------------|
 41. |       21      0    12     7.00       Matched        Ted                  Cox        0 |
 42. |       21      1    23     7.00       Matched    William      Ted         Cox        0 |
     |---------------------------------------------------------------------------------------|
 43. |       22      0    11     7.00       Matched    William      Ted         Cox        0 |
 44. |       22      1    24     7.00       Matched        Ted                  Cox        0 |
     |---------------------------------------------------------------------------------------|
 45. |       24      0     9     7.00       Matched        Ted             Williams        0 |
 46. |       24      1    25     7.00       Matched       Stan             Williams        0 |
     |---------------------------------------------------------------------------------------|
 47. |       25      0    10     7.00       Matched   Theodore   Samuel    Williams        0 |
 48. |       25      1    25     7.00       Matched       Stan             Williams        0 |
     |---------------------------------------------------------------------------------------|
 49. |       12      0     8     5.00       Matched     George   Herman        Ruth        0 |
 50. |       12      1    18     5.00       Matched       Babe                 Ruth        1 |
     |---------------------------------------------------------------------------------------|
 51. |       13      0     8     3.00       Matched     George   Herman        Ruth        0 |
 52. |       13      1    20     3.00       Matched     George   Herman    Ruth, Jr        0 |
     |---------------------------------------------------------------------------------------|
 53. |        .      0     7        .   Not matched     George   Herman   Ruth, Jr.        1 |
 54. |        .      1    19        .   Not matched       Babe             Ruth, Jr        1 |
     +---------------------------------------------------------------------------------------+

. 
. // basic merge - with id() variable
. restore, preserve

. dtalink first 3 -3 middle 3 -1 last 8 -5 yankee 2 0, cutoff(3) id(id) source(file) describe

----------------------------------------------------------------------------
Usage type and variable  |
name                     |    Match weight  No match weight          Caliper
-------------------------+--------------------------------------------------
Blocking variables       |
                  (None) |                                                 0
-------------------------+--------------------------------------------------
Exact matching variables |
                   first |               3               -3                0
                    last |               8               -5                0
                  middle |               3               -1                0
                  yankee |               2                0                0
----------------------------------------------------------------------------
  8 matches were found.

Distribution of matched pair scores, among pairs with score >=3:

Probabilist |
ic matching |
      score |      Freq.
------------+------------+-----------------------------------------------------
       7.00 |          2 |**
      13.00 |          3 |***
      16.00 |          3 |***
------------+------------+-----------------------------------------------------
      Total |          8 
The current configuration of the data is: one row per record.


Description of the new dataset:

Contains data
  obs:            31                          
 vars:             9                          
 size:           899                          
----------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
----------------------------------------------------------------------------------------------------------------------------------------------------------------
_matchID        byte    %10.0g                Matched set identifier
file            byte    %9.0g                 
id              byte    %8.0g                 
_score          byte    %9.2f                 Probabilistic matching score
_matchflag      byte    %11.0g     _mtchflg   Match indicator
first           str8    %9s                   
middle          str6    %9s                   
last            str9    %9s                   
yankee          byte    %8.0g                 
----------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: _matchID  file  id  first  middle  last  yankee
     Note: Dataset has changed since last saved.

. list , sepby(_matchID)

     +-----------------------------------------------------------------------------------+
     | _matchID   file   id   _score   _match~g      first   middle        last   yankee |
     |-----------------------------------------------------------------------------------|
  1. |        1      0    1    13.00    Matched         M.               Mantle        1 |
  2. |        1      0    1    13.00    Matched     Mickey               Mantle        1 |
  3. |        1      0    1    13.00    Matched     Mickey               Mantle        1 |
  4. |        1      1    7    13.00    Matched         M.               Mantle        1 |
  5. |        1      1    7    13.00    Matched     Mickey               Mantle        1 |
     |-----------------------------------------------------------------------------------|
  6. |        2      0    2    16.00    Matched      Henry    Louis      Gehrig        1 |
  7. |        2      0    2    16.00    Matched        Lou               Gehrig        1 |
  8. |        2      1    8    16.00    Matched      Henry    Louis      Gehrig        1 |
  9. |        2      1    8    16.00    Matched        Lou               Gehrig        1 |
     |-----------------------------------------------------------------------------------|
 10. |        3      0    3    13.00    Matched       Babe                 Ruth        1 |
 11. |        3      0    3    13.00    Matched     George   Herman        Ruth        0 |
 12. |        3      0    3    13.00    Matched     George   Herman   Ruth, Jr.        1 |
 13. |        3      1    9    13.00    Matched       Babe                 Ruth        1 |
 14. |        3      1    9    13.00    Matched       Babe             Ruth, Jr        1 |
 15. |        3      1    9    13.00    Matched     George   Herman    Ruth, Jr        0 |
     |-----------------------------------------------------------------------------------|
 16. |        4      0    4    16.00    Matched        Ted             Williams        0 |
 17. |        4      0    4    16.00    Matched   Theodore   Samuel    Williams        0 |
 18. |        4      1   10    16.00    Matched        Ted             Williams        0 |
 19. |        4      1   10    16.00    Matched   Theodore   Samuel    Williams        0 |
     |-----------------------------------------------------------------------------------|
 20. |        5      0    4     7.00    Matched        Ted             Williams        0 |
 21. |        5      0    4     7.00    Matched   Theodore   Samuel    Williams        0 |
 22. |        5      1   12     7.00    Matched       Stan             Williams        0 |
     |-----------------------------------------------------------------------------------|
 23. |        6      0    5    16.00    Matched        Ted                  Cox        0 |
 24. |        6      0    5    16.00    Matched    William      Ted         Cox        0 |
 25. |        6      1   11    16.00    Matched        Ted                  Cox        0 |
 26. |        6      1   11    16.00    Matched    William      Ted         Cox        0 |
     |-----------------------------------------------------------------------------------|
 27. |        7      0    6     7.00    Matched       Stan             Williams        0 |
 28. |        7      1   10     7.00    Matched        Ted             Williams        0 |
 29. |        7      1   10     7.00    Matched   Theodore   Samuel    Williams        0 |
     |-----------------------------------------------------------------------------------|
 30. |        8      0    6    13.00    Matched       Stan             Williams        0 |
 31. |        8      1   12    13.00    Matched       Stan             Williams        0 |
     +-----------------------------------------------------------------------------------+

. 
. // basic merge - with id() variable, keep all scores
. restore, preserve

. dtalink first 3 -3 middle 3 -1 last 8 -5 yankee 2 0, cutoff(3) id(id) source(file) allscores describe

----------------------------------------------------------------------------
Usage type and variable  |
name                     |    Match weight  No match weight          Caliper
-------------------------+--------------------------------------------------
Blocking variables       |
                  (None) |                                                 0
-------------------------+--------------------------------------------------
Exact matching variables |
                   first |               3               -3                0
                    last |               8               -5                0
                  middle |               3               -1                0
                  yankee |               2                0                0
----------------------------------------------------------------------------
  17 matches were found.

Distribution of matched pair scores, among pairs with score >=3:

Probabilist |
ic matching |
      score |      Freq.
------------+------------+-----------------------------------------------------
       3.00 |          1 |*
       5.00 |          1 |*
       7.00 |          6 |******
      13.00 |          6 |******
      16.00 |          3 |***
------------+------------+-----------------------------------------------------
      Total |         17 
The current configuration of the data is: one row per record.


Description of the new dataset:

Contains data
  obs:            34                          
 vars:             5                          
 size:           170                          
----------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
----------------------------------------------------------------------------------------------------------------------------------------------------------------
_matchID        byte    %10.0g                Matched set identifier
file            byte    %9.0g                 
id              byte    %8.0g                 
_score          byte    %9.2f                 Probabilistic matching score
_matchflag      byte    %11.0g     _mtchflg   Match indicator
----------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: _matchID  file  id
     Note: Dataset has changed since last saved.

. list , sepby(_matchID)

     +------------------------------------------+
     | _matchID   file   id   _score   _match~g |
     |------------------------------------------|
  1. |        1      0    1     7.00    Matched |
  2. |        1      1    7     7.00    Matched |
     |------------------------------------------|
  3. |        2      0    1    13.00    Matched |
  4. |        2      1    7    13.00    Matched |
     |------------------------------------------|
  5. |        3      0    2     7.00    Matched |
  6. |        3      1    8     7.00    Matched |
     |------------------------------------------|
  7. |        4      0    2    13.00    Matched |
  8. |        4      1    8    13.00    Matched |
     |------------------------------------------|
  9. |        5      0    2    16.00    Matched |
 10. |        5      1    8    16.00    Matched |
     |------------------------------------------|
 11. |        6      0    3     3.00    Matched |
 12. |        6      1    9     3.00    Matched |
     |------------------------------------------|
 13. |        7      0    3     5.00    Matched |
 14. |        7      1    9     5.00    Matched |
     |------------------------------------------|
 15. |        8      0    3    13.00    Matched |
 16. |        8      1    9    13.00    Matched |
     |------------------------------------------|
 17. |        9      0    4     7.00    Matched |
 18. |        9      1   10     7.00    Matched |
     |------------------------------------------|
 19. |       10      0    4    13.00    Matched |
 20. |       10      1   10    13.00    Matched |
     |------------------------------------------|
 21. |       11      0    4    16.00    Matched |
 22. |       11      1   10    16.00    Matched |
     |------------------------------------------|
 23. |       12      0    4     7.00    Matched |
 24. |       12      1   12     7.00    Matched |
     |------------------------------------------|
 25. |       13      0    5     7.00    Matched |
 26. |       13      1   11     7.00    Matched |
     |------------------------------------------|
 27. |       14      0    5    13.00    Matched |
 28. |       14      1   11    13.00    Matched |
     |------------------------------------------|
 29. |       15      0    5    16.00    Matched |
 30. |       15      1   11    16.00    Matched |
     |------------------------------------------|
 31. |       16      0    6     7.00    Matched |
 32. |       16      1   10     7.00    Matched |
     |------------------------------------------|
 33. |       17      0    6    13.00    Matched |
 34. |       17      1   12    13.00    Matched |
     +------------------------------------------+

. return list

scalars:
         r(scores_max) =  16
         r(scores_min) =  3
          r(scores_sd) =  4.241774046177322
        r(scores_mean) =  10.35294117647059
           r(pairsnum) =  17
                 r(N1) =  12
                 r(N0) =  12
          r(misscheck) =  1
             r(cutoff) =  3
           r(numfiles) =  2

macros:
            r(options) : "allscores"
          r(mtcnegwgt) : "-3 -1 -5 0"
          r(mtcposwgt) : "3 3 8 2"
            r(mtcvars) : "first middle last yankee"
              r(idvar) : "id"
            r(cmdline) : "dtalink first 3 -3 middle 3 -1 last 8 -5 yankee 2 0, cutoff(3) id(id) source(file) allscores describe"
                r(cmd) : "dtalink"

. 
. // basic merge where we keep only the "best" _matchid for each id  --- notice that 4 and 12 are no longer matched together, since 4 was (only) matched to 12
. restore, preserve

. dtalink first 3 -3 middle 3 -1 last 8 -5 yankee 2 0, cutoff(3) id(id) source(file) noweight bestmatch describe
  8 matches were found.
  Keeping best match for each id
  (2 rows deleted.)

Distribution of matched pair scores, among pairs with score >=3:

Probabilist |
ic matching |
      score |      Freq.
------------+------------+-----------------------------------------------------
      13.00 |          3 |***
      16.00 |          3 |***
------------+------------+-----------------------------------------------------
      Total |          6 
The current configuration of the data is: one row per record.


Description of the new dataset:

Contains data
  obs:            25                          
 vars:             9                          
 size:           725                          
----------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
----------------------------------------------------------------------------------------------------------------------------------------------------------------
_matchID        byte    %10.0g                Matched set identifier
file            byte    %9.0g                 
id              byte    %8.0g                 
_score          byte    %9.2f                 Probabilistic matching score
_matchflag      byte    %11.0g     _mtchflg   Match indicator
first           str8    %9s                   
middle          str6    %9s                   
last            str9    %9s                   
yankee          byte    %8.0g                 
----------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: _matchID  file  id  first  middle  last  yankee
     Note: Dataset has changed since last saved.

. list , sepby(_matchID)

     +-----------------------------------------------------------------------------------+
     | _matchID   file   id   _score   _match~g      first   middle        last   yankee |
     |-----------------------------------------------------------------------------------|
  1. |        1      0    1    13.00    Matched         M.               Mantle        1 |
  2. |        1      0    1    13.00    Matched     Mickey               Mantle        1 |
  3. |        1      0    1    13.00    Matched     Mickey               Mantle        1 |
  4. |        1      1    7    13.00    Matched         M.               Mantle        1 |
  5. |        1      1    7    13.00    Matched     Mickey               Mantle        1 |
     |-----------------------------------------------------------------------------------|
  6. |        2      0    2    16.00    Matched      Henry    Louis      Gehrig        1 |
  7. |        2      0    2    16.00    Matched        Lou               Gehrig        1 |
  8. |        2      1    8    16.00    Matched      Henry    Louis      Gehrig        1 |
  9. |        2      1    8    16.00    Matched        Lou               Gehrig        1 |
     |-----------------------------------------------------------------------------------|
 10. |        3      0    3    13.00    Matched       Babe                 Ruth        1 |
 11. |        3      0    3    13.00    Matched     George   Herman        Ruth        0 |
 12. |        3      0    3    13.00    Matched     George   Herman   Ruth, Jr.        1 |
 13. |        3      1    9    13.00    Matched       Babe                 Ruth        1 |
 14. |        3      1    9    13.00    Matched       Babe             Ruth, Jr        1 |
 15. |        3      1    9    13.00    Matched     George   Herman    Ruth, Jr        0 |
     |-----------------------------------------------------------------------------------|
 16. |        4      0    4    16.00    Matched        Ted             Williams        0 |
 17. |        4      0    4    16.00    Matched   Theodore   Samuel    Williams        0 |
 18. |        4      1   10    16.00    Matched        Ted             Williams        0 |
 19. |        4      1   10    16.00    Matched   Theodore   Samuel    Williams        0 |
     |-----------------------------------------------------------------------------------|
 20. |        6      0    5    16.00    Matched        Ted                  Cox        0 |
 21. |        6      0    5    16.00    Matched    William      Ted         Cox        0 |
 22. |        6      1   11    16.00    Matched        Ted                  Cox        0 |
 23. |        6      1   11    16.00    Matched    William      Ted         Cox        0 |
     |-----------------------------------------------------------------------------------|
 24. |        8      0    6    13.00    Matched       Stan             Williams        0 |
 25. |        8      1   12    13.00    Matched       Stan             Williams        0 |
     +-----------------------------------------------------------------------------------+

. 
. // same thing with srcbestmatch(0)
. restore, preserve

. dtalink first 3 -3 middle 3 -1 last 8 -5 yankee 2 0,  cutoff(3) id(id) source(file) noweight srcbestmatch(0)
  8 matches were found.
  Keeping best match for each _id in file 0
  (2 rows deleted.)

Distribution of matched pair scores, among pairs with score >=3:

Probabilist |
ic matching |
      score |      Freq.
------------+------------+-----------------------------------------------------
      13.00 |          3 |***
      16.00 |          3 |***
------------+------------+-----------------------------------------------------
      Total |          6 
The current configuration of the data is: one row per record.

. list , sepby(_matchID)

     +-----------------------------------------------------------------------------------+
     | _matchID   file   id   _score   _match~g      first   middle        last   yankee |
     |-----------------------------------------------------------------------------------|
  1. |        1      0    1    13.00    Matched         M.               Mantle        1 |
  2. |        1      0    1    13.00    Matched     Mickey               Mantle        1 |
  3. |        1      0    1    13.00    Matched     Mickey               Mantle        1 |
  4. |        1      1    7    13.00    Matched         M.               Mantle        1 |
  5. |        1      1    7    13.00    Matched     Mickey               Mantle        1 |
     |-----------------------------------------------------------------------------------|
  6. |        2      0    2    16.00    Matched      Henry    Louis      Gehrig        1 |
  7. |        2      0    2    16.00    Matched        Lou               Gehrig        1 |
  8. |        2      1    8    16.00    Matched      Henry    Louis      Gehrig        1 |
  9. |        2      1    8    16.00    Matched        Lou               Gehrig        1 |
     |-----------------------------------------------------------------------------------|
 10. |        3      0    3    13.00    Matched       Babe                 Ruth        1 |
 11. |        3      0    3    13.00    Matched     George   Herman        Ruth        0 |
 12. |        3      0    3    13.00    Matched     George   Herman   Ruth, Jr.        1 |
 13. |        3      1    9    13.00    Matched       Babe                 Ruth        1 |
 14. |        3      1    9    13.00    Matched       Babe             Ruth, Jr        1 |
 15. |        3      1    9    13.00    Matched     George   Herman    Ruth, Jr        0 |
     |-----------------------------------------------------------------------------------|
 16. |        4      0    4    16.00    Matched        Ted             Williams        0 |
 17. |        4      0    4    16.00    Matched   Theodore   Samuel    Williams        0 |
 18. |        4      1   10    16.00    Matched        Ted             Williams        0 |
 19. |        4      1   10    16.00    Matched   Theodore   Samuel    Williams        0 |
     |-----------------------------------------------------------------------------------|
 20. |        6      0    5    16.00    Matched        Ted                  Cox        0 |
 21. |        6      0    5    16.00    Matched    William      Ted         Cox        0 |
 22. |        6      1   11    16.00    Matched        Ted                  Cox        0 |
 23. |        6      1   11    16.00    Matched    William      Ted         Cox        0 |
     |-----------------------------------------------------------------------------------|
 24. |        8      0    6    13.00    Matched       Stan             Williams        0 |
 25. |        8      1   12    13.00    Matched       Stan             Williams        0 |
     +-----------------------------------------------------------------------------------+

. 
. // same thing with srcbestmatch(1)
. restore, preserve

. dtalink first 3 -3 middle 3 -1 last 8 -5 yankee 2 0,  cutoff(3) id(id) source(file) noweight srcbestmatch(1)
  8 matches were found.
  Keeping best match for each _id in file 1
  (2 rows deleted.)

Distribution of matched pair scores, among pairs with score >=3:

Probabilist |
ic matching |
      score |      Freq.
------------+------------+-----------------------------------------------------
      13.00 |          3 |***
      16.00 |          3 |***
------------+------------+-----------------------------------------------------
      Total |          6 
The current configuration of the data is: one row per record.

. list , sepby(_matchID)

     +-----------------------------------------------------------------------------------+
     | _matchID   file   id   _score   _match~g      first   middle        last   yankee |
     |-----------------------------------------------------------------------------------|
  1. |        1      0    1    13.00    Matched         M.               Mantle        1 |
  2. |        1      0    1    13.00    Matched     Mickey               Mantle        1 |
  3. |        1      0    1    13.00    Matched     Mickey               Mantle        1 |
  4. |        1      1    7    13.00    Matched         M.               Mantle        1 |
  5. |        1      1    7    13.00    Matched     Mickey               Mantle        1 |
     |-----------------------------------------------------------------------------------|
  6. |        2      0    2    16.00    Matched      Henry    Louis      Gehrig        1 |
  7. |        2      0    2    16.00    Matched        Lou               Gehrig        1 |
  8. |        2      1    8    16.00    Matched      Henry    Louis      Gehrig        1 |
  9. |        2      1    8    16.00    Matched        Lou               Gehrig        1 |
     |-----------------------------------------------------------------------------------|
 10. |        3      0    3    13.00    Matched       Babe                 Ruth        1 |
 11. |        3      0    3    13.00    Matched     George   Herman        Ruth        0 |
 12. |        3      0    3    13.00    Matched     George   Herman   Ruth, Jr.        1 |
 13. |        3      1    9    13.00    Matched       Babe                 Ruth        1 |
 14. |        3      1    9    13.00    Matched       Babe             Ruth, Jr        1 |
 15. |        3      1    9    13.00    Matched     George   Herman    Ruth, Jr        0 |
     |-----------------------------------------------------------------------------------|
 16. |        4      0    4    16.00    Matched        Ted             Williams        0 |
 17. |        4      0    4    16.00    Matched   Theodore   Samuel    Williams        0 |
 18. |        4      1   10    16.00    Matched        Ted             Williams        0 |
 19. |        4      1   10    16.00    Matched   Theodore   Samuel    Williams        0 |
     |-----------------------------------------------------------------------------------|
 20. |        6      0    5    16.00    Matched        Ted                  Cox        0 |
 21. |        6      0    5    16.00    Matched    William      Ted         Cox        0 |
 22. |        6      1   11    16.00    Matched        Ted                  Cox        0 |
 23. |        6      1   11    16.00    Matched    William      Ted         Cox        0 |
     |-----------------------------------------------------------------------------------|
 24. |        8      0    6    13.00    Matched       Stan             Williams        0 |
 25. |        8      1   12    13.00    Matched       Stan             Williams        0 |
     +-----------------------------------------------------------------------------------+

. 
. // same thing with bestmatch(0) & ties & combinesets
. restore, preserve

. dtalink first 3 -3 middle 3 -3 last 3 -3 yankee 3 -3, cutoff(3) id(id) source(file) noweight bestmatch ties
  10 matches were found.
  Keeping best match for each id (keeping ties)
  (4 rows deleted.)

Distribution of matched pair scores, among pairs with score >=3:

Probabilist |
ic matching |
      score |      Freq.
------------+------------+-----------------------------------------------------
       9.00 |          3 |***
      12.00 |          3 |***
------------+------------+-----------------------------------------------------
      Total |          6 
The current configuration of the data is: one row per record.

. list , sepby(_matchID)

     +-----------------------------------------------------------------------------------+
     | _matchID   file   id   _score   _match~g      first   middle        last   yankee |
     |-----------------------------------------------------------------------------------|
  1. |        1      0    1     9.00    Matched         M.               Mantle        1 |
  2. |        1      0    1     9.00    Matched     Mickey               Mantle        1 |
  3. |        1      0    1     9.00    Matched     Mickey               Mantle        1 |
  4. |        1      1    7     9.00    Matched         M.               Mantle        1 |
  5. |        1      1    7     9.00    Matched     Mickey               Mantle        1 |
     |-----------------------------------------------------------------------------------|
  6. |        2      0    2    12.00    Matched      Henry    Louis      Gehrig        1 |
  7. |        2      0    2    12.00    Matched        Lou               Gehrig        1 |
  8. |        2      1    8    12.00    Matched      Henry    Louis      Gehrig        1 |
  9. |        2      1    8    12.00    Matched        Lou               Gehrig        1 |
     |-----------------------------------------------------------------------------------|
 10. |        3      0    3     9.00    Matched       Babe                 Ruth        1 |
 11. |        3      0    3     9.00    Matched     George   Herman        Ruth        0 |
 12. |        3      0    3     9.00    Matched     George   Herman   Ruth, Jr.        1 |
 13. |        3      1    9     9.00    Matched       Babe                 Ruth        1 |
 14. |        3      1    9     9.00    Matched       Babe             Ruth, Jr        1 |
 15. |        3      1    9     9.00    Matched     George   Herman    Ruth, Jr        0 |
     |-----------------------------------------------------------------------------------|
 16. |        4      0    4    12.00    Matched        Ted             Williams        0 |
 17. |        4      0    4    12.00    Matched   Theodore   Samuel    Williams        0 |
 18. |        4      1   10    12.00    Matched        Ted             Williams        0 |
 19. |        4      1   10    12.00    Matched   Theodore   Samuel    Williams        0 |
     |-----------------------------------------------------------------------------------|
 20. |        8      0    5    12.00    Matched        Ted                  Cox        0 |
 21. |        8      0    5    12.00    Matched    William      Ted         Cox        0 |
 22. |        8      1   11    12.00    Matched        Ted                  Cox        0 |
 23. |        8      1   11    12.00    Matched    William      Ted         Cox        0 |
     |-----------------------------------------------------------------------------------|
 24. |       10      0    6     9.00    Matched       Stan             Williams        0 |
 25. |       10      1   12     9.00    Matched       Stan             Williams        0 |
     +-----------------------------------------------------------------------------------+

. 
. // same thing with srcbestmatch(0)
. restore, preserve

. dtalink first 3 -3 middle 3 -3 last 3 -3 yankee 3 -3,  cutoff(3) id(id) source(file) noweight srcbestmatch(0) ties
  10 matches were found.
  Keeping best match for each _id in file 0 (keeping ties)
  (4 rows deleted.)

Distribution of matched pair scores, among pairs with score >=3:

Probabilist |
ic matching |
      score |      Freq.
------------+------------+-----------------------------------------------------
       9.00 |          3 |***
      12.00 |          3 |***
------------+------------+-----------------------------------------------------
      Total |          6 
The current configuration of the data is: one row per record.

. list , sepby(_matchID)

     +-----------------------------------------------------------------------------------+
     | _matchID   file   id   _score   _match~g      first   middle        last   yankee |
     |-----------------------------------------------------------------------------------|
  1. |        1      0    1     9.00    Matched         M.               Mantle        1 |
  2. |        1      0    1     9.00    Matched     Mickey               Mantle        1 |
  3. |        1      0    1     9.00    Matched     Mickey               Mantle        1 |
  4. |        1      1    7     9.00    Matched         M.               Mantle        1 |
  5. |        1      1    7     9.00    Matched     Mickey               Mantle        1 |
     |-----------------------------------------------------------------------------------|
  6. |        2      0    2    12.00    Matched      Henry    Louis      Gehrig        1 |
  7. |        2      0    2    12.00    Matched        Lou               Gehrig        1 |
  8. |        2      1    8    12.00    Matched      Henry    Louis      Gehrig        1 |
  9. |        2      1    8    12.00    Matched        Lou               Gehrig        1 |
     |-----------------------------------------------------------------------------------|
 10. |        3      0    3     9.00    Matched       Babe                 Ruth        1 |
 11. |        3      0    3     9.00    Matched     George   Herman        Ruth        0 |
 12. |        3      0    3     9.00    Matched     George   Herman   Ruth, Jr.        1 |
 13. |        3      1    9     9.00    Matched       Babe                 Ruth        1 |
 14. |        3      1    9     9.00    Matched       Babe             Ruth, Jr        1 |
 15. |        3      1    9     9.00    Matched     George   Herman    Ruth, Jr        0 |
     |-----------------------------------------------------------------------------------|
 16. |        4      0    4    12.00    Matched        Ted             Williams        0 |
 17. |        4      0    4    12.00    Matched   Theodore   Samuel    Williams        0 |
 18. |        4      1   10    12.00    Matched        Ted             Williams        0 |
 19. |        4      1   10    12.00    Matched   Theodore   Samuel    Williams        0 |
     |-----------------------------------------------------------------------------------|
 20. |        8      0    5    12.00    Matched        Ted                  Cox        0 |
 21. |        8      0    5    12.00    Matched    William      Ted         Cox        0 |
 22. |        8      1   11    12.00    Matched        Ted                  Cox        0 |
 23. |        8      1   11    12.00    Matched    William      Ted         Cox        0 |
     |-----------------------------------------------------------------------------------|
 24. |       10      0    6     9.00    Matched       Stan             Williams        0 |
 25. |       10      1   12     9.00    Matched       Stan             Williams        0 |
     +-----------------------------------------------------------------------------------+

. 
. // same thing with srcbestmatch(1)
. restore, preserve

. dtalink first 3 -3 middle 3 -3 last 3 -3 yankee 3 -3,  cutoff(3) id(id) source(file) noweight srcbestmatch(1) ties
  10 matches were found.
  Keeping best match for each _id in file 1  (keeping ties)
  (4 rows deleted.)

Distribution of matched pair scores, among pairs with score >=3:

Probabilist |
ic matching |
      score |      Freq.
------------+------------+-----------------------------------------------------
       9.00 |          3 |***
      12.00 |          3 |***
------------+------------+-----------------------------------------------------
      Total |          6 
The current configuration of the data is: one row per record.

. list , sepby(_matchID)

     +-----------------------------------------------------------------------------------+
     | _matchID   file   id   _score   _match~g      first   middle        last   yankee |
     |-----------------------------------------------------------------------------------|
  1. |        1      0    1     9.00    Matched         M.               Mantle        1 |
  2. |        1      0    1     9.00    Matched     Mickey               Mantle        1 |
  3. |        1      0    1     9.00    Matched     Mickey               Mantle        1 |
  4. |        1      1    7     9.00    Matched         M.               Mantle        1 |
  5. |        1      1    7     9.00    Matched     Mickey               Mantle        1 |
     |-----------------------------------------------------------------------------------|
  6. |        2      0    2    12.00    Matched      Henry    Louis      Gehrig        1 |
  7. |        2      0    2    12.00    Matched        Lou               Gehrig        1 |
  8. |        2      1    8    12.00    Matched      Henry    Louis      Gehrig        1 |
  9. |        2      1    8    12.00    Matched        Lou               Gehrig        1 |
     |-----------------------------------------------------------------------------------|
 10. |        3      0    3     9.00    Matched       Babe                 Ruth        1 |
 11. |        3      0    3     9.00    Matched     George   Herman        Ruth        0 |
 12. |        3      0    3     9.00    Matched     George   Herman   Ruth, Jr.        1 |
 13. |        3      1    9     9.00    Matched       Babe                 Ruth        1 |
 14. |        3      1    9     9.00    Matched       Babe             Ruth, Jr        1 |
 15. |        3      1    9     9.00    Matched     George   Herman    Ruth, Jr        0 |
     |-----------------------------------------------------------------------------------|
 16. |        4      0    4    12.00    Matched        Ted             Williams        0 |
 17. |        4      0    4    12.00    Matched   Theodore   Samuel    Williams        0 |
 18. |        4      1   10    12.00    Matched        Ted             Williams        0 |
 19. |        4      1   10    12.00    Matched   Theodore   Samuel    Williams        0 |
     |-----------------------------------------------------------------------------------|
 20. |        8      0    5    12.00    Matched        Ted                  Cox        0 |
 21. |        8      0    5    12.00    Matched    William      Ted         Cox        0 |
 22. |        8      1   11    12.00    Matched        Ted                  Cox        0 |
 23. |        8      1   11    12.00    Matched    William      Ted         Cox        0 |
     |-----------------------------------------------------------------------------------|
 24. |       10      0    6     9.00    Matched       Stan             Williams        0 |
 25. |       10      1   12     9.00    Matched       Stan             Williams        0 |
     +-----------------------------------------------------------------------------------+

. 
. // basic merge with "combined" matched sets --- notice that 4, 6, 10, and 12 are all matched together in a single _matchID
. restore, preserve

. tostring id , replace format(%03.0f)
id was byte now str3

. replace id = id + "XX"
variable id was str3 now str5
(25 real changes made)

. dtalink first 3 -3 middle 3 -1 last 8 -5 yankee 2 0,  cutoff(3) id(id) source(file) combinesets noweight
  8 matches were found.
  (dtalink2::combinesets required 1 iteration to achieve convergence)

Distribution of matched pair scores, among pairs with score >=3:

Probabilist |
ic matching |
      score |      Freq.
------------+------------+-----------------------------------------------------
       7.00 |          2 |**
      13.00 |          3 |***
      16.00 |          3 |***
------------+------------+-----------------------------------------------------
      Total |          8 
The current configuration of the data is: one row per record.

. list , sepby(_matchID)

     +--------------------------------------------------------------------------------------+
     | _matchID   file      id   _score   _match~g      first   middle        last   yankee |
     |--------------------------------------------------------------------------------------|
  1. |        1      0   001XX    13.00    Matched         M.               Mantle        1 |
  2. |        1      0   001XX    13.00    Matched     Mickey               Mantle        1 |
  3. |        1      0   001XX    13.00    Matched     Mickey               Mantle        1 |
  4. |        1      1   007XX    13.00    Matched         M.               Mantle        1 |
  5. |        1      1   007XX    13.00    Matched     Mickey               Mantle        1 |
     |--------------------------------------------------------------------------------------|
  6. |        2      0   002XX    16.00    Matched      Henry    Louis      Gehrig        1 |
  7. |        2      0   002XX    16.00    Matched        Lou               Gehrig        1 |
  8. |        2      1   008XX    16.00    Matched      Henry    Louis      Gehrig        1 |
  9. |        2      1   008XX    16.00    Matched        Lou               Gehrig        1 |
     |--------------------------------------------------------------------------------------|
 10. |        3      0   003XX    13.00    Matched       Babe                 Ruth        1 |
 11. |        3      0   003XX    13.00    Matched     George   Herman        Ruth        0 |
 12. |        3      0   003XX    13.00    Matched     George   Herman   Ruth, Jr.        1 |
 13. |        3      1   009XX    13.00    Matched       Babe                 Ruth        1 |
 14. |        3      1   009XX    13.00    Matched       Babe             Ruth, Jr        1 |
 15. |        3      1   009XX    13.00    Matched     George   Herman    Ruth, Jr        0 |
     |--------------------------------------------------------------------------------------|
 16. |        4      0   004XX    16.00    Matched        Ted             Williams        0 |
 17. |        4      0   004XX    16.00    Matched   Theodore   Samuel    Williams        0 |
 18. |        4      0   006XX    13.00    Matched       Stan             Williams        0 |
 19. |        4      1   010XX    16.00    Matched        Ted             Williams        0 |
 20. |        4      1   010XX    16.00    Matched   Theodore   Samuel    Williams        0 |
 21. |        4      1   012XX    13.00    Matched       Stan             Williams        0 |
     |--------------------------------------------------------------------------------------|
 22. |        6      0   005XX    16.00    Matched        Ted                  Cox        0 |
 23. |        6      0   005XX    16.00    Matched    William      Ted         Cox        0 |
 24. |        6      1   011XX    16.00    Matched        Ted                  Cox        0 |
 25. |        6      1   011XX    16.00    Matched    William      Ted         Cox        0 |
     +--------------------------------------------------------------------------------------+

. 
. // basic merge with `using' syntax
. restore, preserve

. tempfile file2

. keep if file==0
(12 observations deleted)

. drop file

. save "`file2'"
file C:\Users\kkranker\AppData\Local\Temp\ST_4f14_000002.tmp saved

. 
. restore, preserve

. drop if file==0
(13 observations deleted)

. drop file

. dtalink last 3 -3 yankee 1 -1 using "`file2'", cutoff(3) describe

----------------------------------------------------------------------------
Usage type and variable  |
name                     |    Match weight  No match weight          Caliper
-------------------------+--------------------------------------------------
Blocking variables       |
                  (None) |                                                 0
-------------------------+--------------------------------------------------
Exact matching variables |
                    last |               3               -3                0
                  yankee |               1               -1                0
----------------------------------------------------------------------------
  24 matches were found.

Distribution of matched pair scores, among pairs with score >=3:

Probabilist |
ic matching |
      score |      Freq.
------------+------------+-----------------------------------------------------
       4.00 |         24 |************************
------------+------------+-----------------------------------------------------
      Total |         24 
The current configuration of the data is: one row per record.


Description of the new dataset:

Contains data
  obs:            52                          
 vars:            10                          
 size:         1,716                          
----------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
----------------------------------------------------------------------------------------------------------------------------------------------------------------
_matchID        byte    %10.0g                Matched set identifier
_file           byte    %9.0g                 0=master dataset; 1=using dataset
_id             float   %9.0g                 Row number in original data file
_score          byte    %9.2f                 Probabilistic matching score
_matchflag      byte    %11.0g     _mtchflg   Match indicator
id              byte    %8.0g                 
first           str8    %9s                   
middle          str6    %9s                   
last            str9    %9s                   
yankee          byte    %8.0g                 
----------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: _matchID  _file  _id  last  yankee
     Note: Dataset has changed since last saved.

. 
. // the parallel prefix might speed things up:
. restore

. drop if file==0
(13 observations deleted)

. drop file

. gen subsetfile = floor(_n/5)

. sort subsetfile, stable

. cap nois {
.   parallel setclusters 2
N Child processes: 2
Stata dir:  C:\Program Files (x86)\Stata15/StataMP-64.exe
.   parallel, by(subsetfile) processors(2): dtalink last 3 -3 yankee 1 -1 using "`file2'", cutoff(3)
--------------------------------------------------------------------------------
Parallel Computing with Stata
Child processes: 2
pll_id         : lo8kknh7v1
Running at     : C:\Users\kkranker\Documents\Stata\dtalink\code-dtalink
Randtype       : datetime
Waiting for the child processes to finish...
child process 0001 has exited without error...
child process 0002 has exited without error...
--------------------------------------------------------------------------------
Enter -parallel printlog #- to checkout logfiles.
--------------------------------------------------------------------------------
.   tab  _score, plot

Probabilist |
ic matching |
      score |      Freq.
------------+------------+-----------------------------------------------------
       4.00 |         48 |************************************************
------------+------------+-----------------------------------------------------
      Total |         48 
. }

. 
. 
. ***************************************
. * Trivial example
. ***************************************
. 
. clear

. set obs 10
number of observations (_N) was 0, now 10

. set seed 1

. gen byte file = _n <= .45*_N

. gen int var1 = floor(runiform()*3) if runiform()<.75
(2 missing values generated)

. tab var1 file, mi

           |         file
      var1 |         0          1 |     Total
-----------+----------------------+----------
         0 |         1          3 |         4 
         1 |         3          0 |         3 
         2 |         0          1 |         1 
         . |         2          0 |         2 
-----------+----------------------+----------
     Total |         6          4 |        10 

. dtalink var1 1 0 var1 1 0 0, source(file) wide cutoff(1)

------------------------------------------------------------------------------
Usage type and variable    |
name                       |    Match weight  No match weight          Caliper
---------------------------+--------------------------------------------------
Blocking variables         |
                    (None) |                                                 0
---------------------------+--------------------------------------------------
Caliper matching variables |
                  var1 (1) |               1                0                0
---------------------------+--------------------------------------------------
Exact matching variables   |
                  var1 (2) |               1                0                0
------------------------------------------------------------------------------
  3 matches were found.

Distribution of matched pair scores, among pairs with score >=1:

Probabilist |
ic matching |
      score |      Freq.
------------+------------+-----------------------------------------------------
       2.00 |          3 |***
------------+------------+-----------------------------------------------------
      Total |          3 
The current configuration of the data is: one row per matched pair.

. list

     +--------------------------------------------+
     | _matchID   _id0   _id1   _score   _match~g |
     |--------------------------------------------|
  1. |        1      9      1     2.00    Matched |
  2. |        2      9      2     2.00    Matched |
  3. |        3      9      4     2.00    Matched |
     +--------------------------------------------+

. 
. 
. *********************************************
. * Example with fake "birth certificate" data
. *********************************************
. 
. * This program shows how the dtalink command might be used to verify the quality of a data linkage.
. * Suppose someone else links a new file to (variables  dob ssn lastname and firstname) onto your
. * existing dataset (variables mpr_dob mpr_ssn mpr_lastname and mpr_firstname).  After a little work to
. * reshape the dataset, you can use dtalink to score each matched pairs. The trick is to use the
. * block() option to restrict the matched pairs to those that were found by the other person.
. 
. clear

. input byte trueID byte fileid str16 dob_str double ssn str16 lastname str9 firstname byte mofb int yofb str4 lastname_soundex str8 firstname_nysiis

       trueID    fileid           dob_str         ssn          lastname  firstname      mofb      yofb  lastnam~x  firstna~s
  1.       1  0  "01/05/1985"  1000000000  "Doe"  "Jane"  1  1985  "D000"  "jan"
  2.       1  1  "01/06/1985"  1000000000  "Doe"  "Jane"  1  1985  "D000"  "jan"
  3.       2  0  "02/07/1985"  1000000001  "Smith"  "Mary"  2  1985  "S530"  "mary"
  4.       2  1  "02/07/1985"  .  "Smoth"  "Mary"  2  1985  "S530"  "mary"
  5.       3  0  "05/05/1985"  1000000002  "Johnson"  "Catherine"  5  1985  "J525"  "cataran"
  6.       3  1  "05/05/1985"  1000000002  "Jonson"  "Katie"  5  1985  "J525"  "caty"
  7.       4  0  "05/05/1985"  1000000003  "Jones"  "Elizabeth"  5  1985  "J520"  "elasabat"
  8.       4  1  "05/05/1985"  1000000003  "Jones"  ""  5  1985  "J520"  ""
  9.       5  0  "01/01/1983"  .  "Sanchez"  "Maria"  1  1983  "S522"  "mar"
 10.       5  1  "01/01/1983"  1000000004  "Sanchez-Martinez"  "Maria"  1  1983  "S522"  "mar"
 11.       6  0  "05/05/1985"  1000000005  "Johnson"  "Jane"  5  1985  "J525"  "jan"
 12.       6  1  "05/05/1985"  1000000005  "Johnson"  "Jane"  5  1985  "J525"  "jan"
 13.       7  0  "11/25/1985"  1000000006  "Miller"  "Amy"  11  1985  "M460"  "any"
 14.       8  0  "08/05/2000"  1000000007  "Miller"  "Amy"  8  2000  "M460"  "any"
 15.       8  1  "05/01/1980"  2000000007  "Miller"  "Anne"  5  1980  "M460"  "an"
 16. end

. 
. gen int dob = date(dob_str,"MDY")

. format dob %tdN/D/CY

. format ssn %12.0f

. order dob, before(dob_str)

. drop dob_str

. label define fileid 0 "A" 1 "B"

. label val fileid fileid

. 
. label var trueID           "Study ID"

. label var fileid           "File A or B"

. label var dob              "Date of birth"

. label var ssn              "Social security number"

. label var lastname         "Last name"

. label var firstname        "First name"

. label var mofb             "Month of birth"

. label var yofb             "Year of birth"

. label var lastname_soundex "Soundex code for last name"

. label var firstname_nysiis "NYSIIS code for first name"

. 
. // show reshaped dataset
. desc

Contains data
  obs:            15                          
 vars:            10                          
 size:           780                          
----------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
----------------------------------------------------------------------------------------------------------------------------------------------------------------
trueID          byte    %8.0g                 Study ID
fileid          byte    %8.0g      fileid     File A or B
dob             int     %tdN/D/CY             Date of birth
ssn             double  %12.0f                Social security number
lastname        str16   %16s                  Last name
firstname       str9    %9s                   First name
mofb            byte    %8.0g                 Month of birth
yofb            int     %8.0g                 Year of birth
lastname_soun~x str4    %9s                   Soundex code for last name
firstname_nys~s str8    %9s                   NYSIIS code for first name
----------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. list,sepby(trueID) noobs

  +--------------------------------------------------------------------------------------------------------------+
  | trueID   fileid          dob          ssn           lastname   firstname   mofb   yofb   lastna~x   firstn~s |
  |--------------------------------------------------------------------------------------------------------------|
  |      1        A   01/05/1985   1000000000                Doe        Jane      1   1985       D000        jan |
  |      1        B   01/06/1985   1000000000                Doe        Jane      1   1985       D000        jan |
  |--------------------------------------------------------------------------------------------------------------|
  |      2        A   02/07/1985   1000000001              Smith        Mary      2   1985       S530       mary |
  |      2        B   02/07/1985            .              Smoth        Mary      2   1985       S530       mary |
  |--------------------------------------------------------------------------------------------------------------|
  |      3        A   05/05/1985   1000000002            Johnson   Catherine      5   1985       J525    cataran |
  |      3        B   05/05/1985   1000000002             Jonson       Katie      5   1985       J525       caty |
  |--------------------------------------------------------------------------------------------------------------|
  |      4        A   05/05/1985   1000000003              Jones   Elizabeth      5   1985       J520   elasabat |
  |      4        B   05/05/1985   1000000003              Jones                  5   1985       J520            |
  |--------------------------------------------------------------------------------------------------------------|
  |      5        A   01/01/1983            .            Sanchez       Maria      1   1983       S522        mar |
  |      5        B   01/01/1983   1000000004   Sanchez-Martinez       Maria      1   1983       S522        mar |
  |--------------------------------------------------------------------------------------------------------------|
  |      6        A   05/05/1985   1000000005            Johnson        Jane      5   1985       J525        jan |
  |      6        B   05/05/1985   1000000005            Johnson        Jane      5   1985       J525        jan |
  |--------------------------------------------------------------------------------------------------------------|
  |      7        A   11/25/1985   1000000006             Miller         Amy     11   1985       M460        any |
  |--------------------------------------------------------------------------------------------------------------|
  |      8        A   08/05/2000   1000000007             Miller         Amy      8   2000       M460        any |
  |      8        B   05/01/1980   2000000007             Miller        Anne      5   1980       M460         an |
  +--------------------------------------------------------------------------------------------------------------+

. 
. preserve

. 
. // score the linkages
. dtalink dob 6.2 -1.7 yofb 1 -1 mofb 1 -1 ssn 15 -5 lastname 3.2 -1.0 lastname_soundex 3.2 -.9 firstname 2.5 -1.8 firstname_nysiis 2.5 -1.7, ///
>   source(fileid) cutoff(-9999) describe examples(16)

----------------------------------------------------------------------------
Usage type and variable  |
name                     |    Match weight  No match weight          Caliper
-------------------------+--------------------------------------------------
Blocking variables       |
                  (None) |                                                 0
-------------------------+--------------------------------------------------
Exact matching variables |
                     dob |             6.2             -1.7                0
               firstname |             2.5             -1.8                0
        firstname_nysiis |             2.5             -1.7                0
                lastname |             3.2               -1                0
        lastname_soundex |             3.2              -.9                0
                    mofb |               1               -1                0
                     ssn |              15               -5                0
                    yofb |               1               -1                0
----------------------------------------------------------------------------
  56 matches were found.

Distribution of matched pair scores, among pairs with score >=-9999:

Probabilist |
ic matching |
      score |      Freq.
------------+------------+-----------------------------------------------------
     -14.10 |         11 |***********
     -12.10 |         13 |*************
     -10.60 |          1 |*
      -9.10 |          5 |*****
      -8.60 |          3 |***
      -7.10 |          6 |******
      -5.80 |          2 |**
      -5.60 |          1 |*
      -3.60 |          2 |**
      -2.20 |          2 |**
       1.30 |          2 |**
       1.90 |          1 |*
       6.10 |          1 |*
      15.40 |          2 |**
      21.90 |          1 |*
      26.70 |          1 |*
      29.60 |          1 |*
      34.60 |          1 |*
------------+------------+-----------------------------------------------------
      Total |         56 
The current configuration of the data is: one row per record.


Description of the new dataset:

Contains data
  obs:           112                          
 vars:            14                          
 size:         7,392                          
----------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
----------------------------------------------------------------------------------------------------------------------------------------------------------------
_matchID        byte    %10.0g                Matched set identifier
fileid          byte    %8.0g      fileid     File A or B
_id             float   %9.0g                 Row number in original data file
_score          double  %9.2f                 Probabilistic matching score
_matchflag      byte    %11.0g     _mtchflg   Match indicator
trueID          byte    %8.0g                 Study ID
dob             int     %tdN/D/CY             Date of birth
ssn             double  %12.0f                Social security number
lastname        str16   %16s                  Last name
firstname       str9    %9s                   First name
mofb            byte    %8.0g                 Month of birth
yofb            int     %8.0g                 Year of birth
lastname_soun~x str4    %9s                   Soundex code for last name
firstname_nys~s str8    %9s                   NYSIIS code for first name
----------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: _matchID  fileid  _id  dob  yofb  mofb  ssn  lastname  lastname_soundex  firstname  firstname_nysiis
     Note: Dataset has changed since last saved.

Examples (up to 16 rows):

     +-------------------------------------------------------------------------------------------------------------------------------------------+
     | _matchID   fileid   _id   _score   _match~g   trueID          dob          ssn   lastname   firstname   mofb   yofb   lastna~x   firstn~s |
     |-------------------------------------------------------------------------------------------------------------------------------------------|
  1. |        1        A     1    26.70    Matched        1   01/05/1985   1000000000        Doe        Jane      1   1985       D000        jan |
  2. |        1        B     2    26.70    Matched        1   01/06/1985   1000000000        Doe        Jane      1   1985       D000        jan |
     |-------------------------------------------------------------------------------------------------------------------------------------------|
  3. |        2        A     3   -12.10    Matched        2   02/07/1985   1000000001      Smith        Mary      2   1985       S530       mary |
  4. |        2        B     2   -12.10    Matched        1   01/06/1985   1000000000        Doe        Jane      1   1985       D000        jan |
     |-------------------------------------------------------------------------------------------------------------------------------------------|
  5. |        3        A     5   -12.10    Matched        3   05/05/1985   1000000002    Johnson   Catherine      5   1985       J525    cataran |
  6. |        3        B     2   -12.10    Matched        1   01/06/1985   1000000000        Doe        Jane      1   1985       D000        jan |
     |-------------------------------------------------------------------------------------------------------------------------------------------|
  7. |        4        A     7   -12.10    Matched        4   05/05/1985   1000000003      Jones   Elizabeth      5   1985       J520   elasabat |
  8. |        4        B     2   -12.10    Matched        1   01/06/1985   1000000000        Doe        Jane      1   1985       D000        jan |
     |-------------------------------------------------------------------------------------------------------------------------------------------|
  9. |        5        A     9    -7.10    Matched        5   01/01/1983            .    Sanchez       Maria      1   1983       S522        mar |
 10. |        5        B     2    -7.10    Matched        1   01/06/1985   1000000000        Doe        Jane      1   1985       D000        jan |
     |-------------------------------------------------------------------------------------------------------------------------------------------|
 11. |        6        A    11    -3.60    Matched        6   05/05/1985   1000000005    Johnson        Jane      5   1985       J525        jan |
 12. |        6        B     2    -3.60    Matched        1   01/06/1985   1000000000        Doe        Jane      1   1985       D000        jan |
     |-------------------------------------------------------------------------------------------------------------------------------------------|
 13. |        7        A    13   -12.10    Matched        7   11/25/1985   1000000006     Miller         Amy     11   1985       M460        any |
 14. |        7        B     2   -12.10    Matched        1   01/06/1985   1000000000        Doe        Jane      1   1985       D000        jan |
     |-------------------------------------------------------------------------------------------------------------------------------------------|
 15. |        8        A    14   -14.10    Matched        8   08/05/2000   1000000007     Miller         Amy      8   2000       M460        any |
 16. |        8        B     2   -14.10    Matched        1   01/06/1985   1000000000        Doe        Jane      1   1985       D000        jan |
     +-------------------------------------------------------------------------------------------------------------------------------------------+

. list if _matchflag!=1, sepby(_matchID)

. 
. 
. // score the linkages with the distance() option too
. restore, preserve

. dtalink dob 6.2 -1.7 dob 20 0 30 dob 10 -5 365 yofb 1 -1 mofb 1 -1 ssn 15 -5 lastname 3.2 -1.0 lastname_soundex 3.2 -.9 firstname 2.5 -1.8 firstname_nysiis 2.
> 5 -1.7, ///
>   source(fileid) cutoff(-9999) describe examples(16)

------------------------------------------------------------------------------
Usage type and variable    |
name                       |    Match weight  No match weight          Caliper
---------------------------+--------------------------------------------------
Blocking variables         |
                    (None) |                                                 0
---------------------------+--------------------------------------------------
Caliper matching variables |
                   dob (1) |              20                0               30
                   dob (2) |              10               -5              365
---------------------------+--------------------------------------------------
Exact matching variables   |
                   dob (3) |             6.2             -1.7                0
                 firstname |             2.5             -1.8                0
          firstname_nysiis |             2.5             -1.7                0
                  lastname |             3.2               -1                0
          lastname_soundex |             3.2              -.9                0
                      mofb |               1               -1                0
                       ssn |              15               -5                0
                      yofb |               1               -1                0
------------------------------------------------------------------------------
  56 matches were found.

Distribution of matched pair scores, among pairs with score >=-9999:

Probabilist |
ic matching |
      score |      Freq.
------------+------------+-----------------------------------------------------
     -19.10 |         11 |***********
     -17.10 |          4 |****
     -15.60 |          1 |*
     -14.10 |          5 |*****
     -12.10 |          1 |*
     -10.80 |          2 |**
     -10.60 |          1 |*
      -2.10 |          9 |*********
       1.40 |          3 |***
       2.90 |          5 |*****
       6.40 |          2 |**
      27.80 |          2 |**
      31.30 |          2 |**
      31.90 |          1 |*
      36.10 |          1 |*
      45.40 |          2 |**
      51.90 |          1 |*
      56.70 |          1 |*
      59.60 |          1 |*
      64.60 |          1 |*
------------+------------+-----------------------------------------------------
      Total |         56 
The current configuration of the data is: one row per record.


Description of the new dataset:

Contains data
  obs:           112                          
 vars:            14                          
 size:         7,392                          
----------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
----------------------------------------------------------------------------------------------------------------------------------------------------------------
_matchID        byte    %10.0g                Matched set identifier
fileid          byte    %8.0g      fileid     File A or B
_id             float   %9.0g                 Row number in original data file
_score          double  %9.2f                 Probabilistic matching score
_matchflag      byte    %11.0g     _mtchflg   Match indicator
trueID          byte    %8.0g                 Study ID
dob             int     %tdN/D/CY             Date of birth
ssn             double  %12.0f                Social security number
lastname        str16   %16s                  Last name
firstname       str9    %9s                   First name
mofb            byte    %8.0g                 Month of birth
yofb            int     %8.0g                 Year of birth
lastname_soun~x str4    %9s                   Soundex code for last name
firstname_nys~s str8    %9s                   NYSIIS code for first name
----------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: _matchID  fileid  _id  dob  dob  dob  yofb  mofb  ssn  lastname  lastname_soundex  firstname  firstname_nysiis
     Note: Dataset has changed since last saved.

Examples (up to 16 rows):

     +-------------------------------------------------------------------------------------------------------------------------------------------+
     | _matchID   fileid   _id   _score   _match~g   trueID          dob          ssn   lastname   firstname   mofb   yofb   lastna~x   firstn~s |
     |-------------------------------------------------------------------------------------------------------------------------------------------|
  1. |        1        A     1    56.70    Matched        1   01/05/1985   1000000000        Doe        Jane      1   1985       D000        jan |
  2. |        1        B     2    56.70    Matched        1   01/06/1985   1000000000        Doe        Jane      1   1985       D000        jan |
     |-------------------------------------------------------------------------------------------------------------------------------------------|
  3. |        2        A     3    -2.10    Matched        2   02/07/1985   1000000001      Smith        Mary      2   1985       S530       mary |
  4. |        2        B     2    -2.10    Matched        1   01/06/1985   1000000000        Doe        Jane      1   1985       D000        jan |
     |-------------------------------------------------------------------------------------------------------------------------------------------|
  5. |        3        A     5    -2.10    Matched        3   05/05/1985   1000000002    Johnson   Catherine      5   1985       J525    cataran |
  6. |        3        B     2    -2.10    Matched        1   01/06/1985   1000000000        Doe        Jane      1   1985       D000        jan |
     |-------------------------------------------------------------------------------------------------------------------------------------------|
  7. |        4        A     7    -2.10    Matched        4   05/05/1985   1000000003      Jones   Elizabeth      5   1985       J520   elasabat |
  8. |        4        B     2    -2.10    Matched        1   01/06/1985   1000000000        Doe        Jane      1   1985       D000        jan |
     |-------------------------------------------------------------------------------------------------------------------------------------------|
  9. |        5        A     9   -12.10    Matched        5   01/01/1983            .    Sanchez       Maria      1   1983       S522        mar |
 10. |        5        B     2   -12.10    Matched        1   01/06/1985   1000000000        Doe        Jane      1   1985       D000        jan |
     |-------------------------------------------------------------------------------------------------------------------------------------------|
 11. |        6        A    11     6.40    Matched        6   05/05/1985   1000000005    Johnson        Jane      5   1985       J525        jan |
 12. |        6        B     2     6.40    Matched        1   01/06/1985   1000000000        Doe        Jane      1   1985       D000        jan |
     |-------------------------------------------------------------------------------------------------------------------------------------------|
 13. |        7        A    13    -2.10    Matched        7   11/25/1985   1000000006     Miller         Amy     11   1985       M460        any |
 14. |        7        B     2    -2.10    Matched        1   01/06/1985   1000000000        Doe        Jane      1   1985       D000        jan |
     |-------------------------------------------------------------------------------------------------------------------------------------------|
 15. |        8        A    14   -19.10    Matched        8   08/05/2000   1000000007     Miller         Amy      8   2000       M460        any |
 16. |        8        B     2   -19.10    Matched        1   01/06/1985   1000000000        Doe        Jane      1   1985       D000        jan |
     +-------------------------------------------------------------------------------------------------------------------------------------------+

. list if _matchflag!=1, sepby(_matchID)

. 
. // score the linkages with only the distance() option
. restore, preserve

. dtalink dob 20 0 30 dob 10 -5 365 , source(fileid) cutoff(-9999) describe examples(16)

------------------------------------------------------------------------------
Usage type and variable    |
name                       |    Match weight  No match weight          Caliper
---------------------------+--------------------------------------------------
Blocking variables         |
                    (None) |                                                 0
---------------------------+--------------------------------------------------
Caliper matching variables |
                   dob (1) |              20                0               30
                   dob (2) |              10               -5              365
------------------------------------------------------------------------------
  56 matches were found.

Distribution of matched pair scores, among pairs with score >=-9999:

Probabilist |
ic matching |
      score |      Freq.
------------+------------+-----------------------------------------------------
      -5.00 |         25 |*************************
      10.00 |         19 |*******************
      30.00 |         12 |************
------------+------------+-----------------------------------------------------
      Total |         56 
The current configuration of the data is: one row per record.


Description of the new dataset:

Contains data
  obs:           112                          
 vars:            14                          
 size:         6,608                          
----------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
----------------------------------------------------------------------------------------------------------------------------------------------------------------
_matchID        byte    %10.0g                Matched set identifier
fileid          byte    %8.0g      fileid     File A or B
_id             float   %9.0g                 Row number in original data file
_score          byte    %9.2f                 Probabilistic matching score
_matchflag      byte    %11.0g     _mtchflg   Match indicator
trueID          byte    %8.0g                 Study ID
dob             int     %tdN/D/CY             Date of birth
ssn             double  %12.0f                Social security number
lastname        str16   %16s                  Last name
firstname       str9    %9s                   First name
mofb            byte    %8.0g                 Month of birth
yofb            int     %8.0g                 Year of birth
lastname_soun~x str4    %9s                   Soundex code for last name
firstname_nys~s str8    %9s                   NYSIIS code for first name
----------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: _matchID  fileid  _id  dob  dob
     Note: Dataset has changed since last saved.

Examples (up to 16 rows):

     +-------------------------------------------------------------------------------------------------------------------------------------------+
     | _matchID   fileid   _id   _score   _match~g   trueID          dob          ssn   lastname   firstname   mofb   yofb   lastna~x   firstn~s |
     |-------------------------------------------------------------------------------------------------------------------------------------------|
  1. |        1        A     1    30.00    Matched        1   01/05/1985   1000000000        Doe        Jane      1   1985       D000        jan |
  2. |        1        B     2    30.00    Matched        1   01/06/1985   1000000000        Doe        Jane      1   1985       D000        jan |
     |-------------------------------------------------------------------------------------------------------------------------------------------|
  3. |        2        A     3    10.00    Matched        2   02/07/1985   1000000001      Smith        Mary      2   1985       S530       mary |
  4. |        2        B     2    10.00    Matched        1   01/06/1985   1000000000        Doe        Jane      1   1985       D000        jan |
     |-------------------------------------------------------------------------------------------------------------------------------------------|
  5. |        3        A     5    10.00    Matched        3   05/05/1985   1000000002    Johnson   Catherine      5   1985       J525    cataran |
  6. |        3        B     2    10.00    Matched        1   01/06/1985   1000000000        Doe        Jane      1   1985       D000        jan |
     |-------------------------------------------------------------------------------------------------------------------------------------------|
  7. |        4        A     7    10.00    Matched        4   05/05/1985   1000000003      Jones   Elizabeth      5   1985       J520   elasabat |
  8. |        4        B     2    10.00    Matched        1   01/06/1985   1000000000        Doe        Jane      1   1985       D000        jan |
     |-------------------------------------------------------------------------------------------------------------------------------------------|
  9. |        5        A     9    -5.00    Matched        5   01/01/1983            .    Sanchez       Maria      1   1983       S522        mar |
 10. |        5        B     2    -5.00    Matched        1   01/06/1985   1000000000        Doe        Jane      1   1985       D000        jan |
     |-------------------------------------------------------------------------------------------------------------------------------------------|
 11. |        6        A    11    10.00    Matched        6   05/05/1985   1000000005    Johnson        Jane      5   1985       J525        jan |
 12. |        6        B     2    10.00    Matched        1   01/06/1985   1000000000        Doe        Jane      1   1985       D000        jan |
     |-------------------------------------------------------------------------------------------------------------------------------------------|
 13. |        7        A    13    10.00    Matched        7   11/25/1985   1000000006     Miller         Amy     11   1985       M460        any |
 14. |        7        B     2    10.00    Matched        1   01/06/1985   1000000000        Doe        Jane      1   1985       D000        jan |
     |-------------------------------------------------------------------------------------------------------------------------------------------|
 15. |        8        A    14    -5.00    Matched        8   08/05/2000   1000000007     Miller         Amy      8   2000       M460        any |
 16. |        8        B     2    -5.00    Matched        1   01/06/1985   1000000000        Doe        Jane      1   1985       D000        jan |
     +-------------------------------------------------------------------------------------------------------------------------------------------+

. list if _matchflag!=1, sepby(_matchID)

. 
. 
. // calc weights as if this were a training dataset
. restore, preserve

. dtalink trueID 1 -1 dob 0 0 30 dob 0 0 365 yofb 0 0 mofb 0 0 ssn 0 0 lastname 0 0 lastname_soundex 0 0 firstname 0 0 firstname_nysiis 0 0, source(fileid) cuto
> ff(0) calcweight

------------------------------------------------------------------------------
Usage type and variable    |
name                       |    Match weight  No match weight          Caliper
---------------------------+--------------------------------------------------
Blocking variables         |
                    (None) |                                                 0
---------------------------+--------------------------------------------------
Caliper matching variables |
                   dob (1) |               0                0               30
                   dob (2) |               0                0              365
---------------------------+--------------------------------------------------
Exact matching variables   |
                 firstname |               0                0                0
          firstname_nysiis |               0                0                0
                  lastname |               0                0                0
          lastname_soundex |               0                0                0
                      mofb |               0                0                0
                       ssn |               0                0                0
                    trueID |               1               -1                0
                      yofb |               0                0                0
------------------------------------------------------------------------------
  7 matches were found.

Suggested matching weights:
-----------------------------------------------------------------------
                           | new_wgt_match  new_wgt_no_match    Caliper
---------------------------+-------------------------------------------
Caliper_matching_variables |
                       dob |         2.807            -2.619     30.000
                       dob |         0.748            -1.778    365.000
---------------------------+-------------------------------------------
Exact_matching_variables   |
                    trueID |      1022.000         -1022.000          .
                      yofb |         0.748            -1.778          .
                      mofb |         1.933            -2.441          .
                       ssn |      1021.193            -1.222          .
                  lastname |         3.807            -1.162          .
          lastname_soundex |         4.030         -1021.909          .
                 firstname |         3.807            -1.162          .
          firstname_nysiis |         3.807            -1.162          .
-----------------------------------------------------------------------

Distribution of matched pair scores, among pairs with score >=0:

Probabilist |
ic matching |
      score |      Freq.
------------+------------+-----------------------------------------------------
       1.00 |          7 |*******
------------+------------+-----------------------------------------------------
      Total |          7 
The current configuration of the data is: one row per record.

. 
. // remove weights for trueID
. local newwgts = r(new_wgt_specs)

. di "`macval(_newwgts)'"


. gettoken trsh newwgts : newwgts

. gettoken trsh newwgts : newwgts

. gettoken trsh newwgts : newwgts

. di "`macval(_newwgts)'"


. 
. // see what happens when we use recommended weights
. // (after picking a new cutoff)
. restore

. dtalink `newwgts', source(fileid) cutoff(6) bestmatch

------------------------------------------------------------------------------
Usage type and variable    |
name                       |    Match weight  No match weight          Caliper
---------------------------+--------------------------------------------------
Blocking variables         |
                    (None) |                                                 0
---------------------------+--------------------------------------------------
Caliper matching variables |
                   dob (1) |        2.807355         -2.61891               30
                   dob (2) |        .7484612        -1.777608              365
---------------------------+--------------------------------------------------
Exact matching variables   |
                 firstname |        3.807355        -1.162271                0
          firstname_nysiis |        3.807355        -1.162271                0
                  lastname |        3.807355        -1.162271                0
          lastname_soundex |        4.029747        -1021.909                0
                      mofb |        1.932886        -2.440573                0
                       ssn |        1021.193        -1.222392                0
                      yofb |        .7484612        -1.777608                0
------------------------------------------------------------------------------
  7 matches were found.
  Keeping best match for each _id
  (1 rows deleted.)

Distribution of matched pair scores, among pairs with score >=6:

Probabilist |
ic matching |
      score |      Freq.
------------+------------+-----------------------------------------------------
      16.72 |          2 |**
    1027.97 |          1 |*
    1035.27 |          1 |*
    1042.88 |          2 |**
------------+------------+-----------------------------------------------------
      Total |          6 
The current configuration of the data is: one row per record.

. 
. // It worked!
. sort _matchID trueID

. list _matchflag _matchID trueID, sepby(_matchID)

     +---------------------------------+
     |  _matchflag   _matchID   trueID |
     |---------------------------------|
  1. |     Matched          1        1 |
  2. |     Matched          1        1 |
     |---------------------------------|
  3. |     Matched          2        2 |
  4. |     Matched          2        2 |
     |---------------------------------|
  5. |     Matched          3        3 |
  6. |     Matched          3        3 |
     |---------------------------------|
  7. |     Matched          4        4 |
  8. |     Matched          4        4 |
     |---------------------------------|
  9. |     Matched          5        5 |
 10. |     Matched          5        5 |
     |---------------------------------|
 11. |     Matched          7        6 |
 12. |     Matched          7        6 |
     |---------------------------------|
 13. | Not matched          .        7 |
 14. | Not matched          .        8 |
 15. | Not matched          .        8 |
     +---------------------------------+

. by  _matchID (trueID): assert trueID[_n]==trueID[_N] if _matchflag

. 
. 
. ***************************************
. * Short program for 1-line timers
. ***************************************
. 
. program define timer99
  1.   _on_colon_parse `0'
  2.   timer clear 99
  3.   timer on 99
  4.   `s(after)'
  5.   timer off 99
  6.   qui timer list 99
  7.   di as txt "  Time to run = " _c
  8.   if r(t99) < 90           di as res =round(r(t99)      ,.01) " sec"
  9.   else if r(t99)/60 < 400  di as res =round(r(t99)/60   ,.01) " min"
 10.   else                     di as res =round(r(t99)/60/60,.01) " hr"
 11.   timer clear 99
 12. end

. 
. 
. ***************************************
. * Randomly generated data
. ***************************************
. 
. * ----------- Tall example dataset ----------
. 
. clear

. set seed 1

. set obs 2000
number of observations (_N) was 0, now 2,000

. gen int x1 = floor(runiform(0,30))

. gen int x2 = floor(runiform(0,30))

. gen int x3 = floor(runiform(0,30))

. gen x4 = cond(runiform()<.5,"male","female")

. gen byte b1 = runiform()<.5

. gen byte b2 = runiform()<.5

. gen byte b3 = runiform()<.5

. gen str2 b4 = cond(runiform()<.5,"TX","CA")

. compress
  variable x1 was int now byte
  variable x2 was int now byte
  variable x3 was int now byte
  (6,000 bytes saved)

. local myfloor = 4

. 
. 
. * ----------- without missing data ----------
. 
. preserve

. dtalink x1 1 -1 x2 2 -2 x3 3 -3 x4 .1 -5 in 1/20, cutoff(4) describe examples(16)

----------------------------------------------------------------------------
Usage type and variable  |
name                     |    Match weight  No match weight          Caliper
-------------------------+--------------------------------------------------
Blocking variables       |
                  (None) |                                                 0
-------------------------+--------------------------------------------------
Exact matching variables |
                      x1 |               1               -1                0
                      x2 |               2               -2                0
                      x3 |               3               -3                0
                      x4 |              .1               -5                0
----------------------------------------------------------------------------
  No matches were found.
(Restoring the data.)

. 
. restore, preserve

. dtalink x1 1 -1 x2 2 -2 x3 3 -3 x4 .1 -5 in 1/20, cutoff(4) block(b1 b2 | b3 | b1 b3) describe examples(16)

----------------------------------------------------------------------------
Usage type and variable  |
name                     |    Match weight  No match weight          Caliper
-------------------------+--------------------------------------------------
Blocking variables       |
                   b1 b2 |                                                 0
                   b1 b3 |                                                 0
                      b3 |                                                 0
-------------------------+--------------------------------------------------
Exact matching variables |
                      x1 |               1               -1                0
                      x2 |               2               -2                0
                      x3 |               3               -3                0
                      x4 |              .1               -5                0
----------------------------------------------------------------------------
Starting 4 blocks for blocking set 1 of 3: b1 b2. Each dot is 1 block.
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
....
Starting 2 blocks for blocking set 2 of 3: b3. Each dot is 1 block.
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..
Starting 4 blocks for blocking set 3 of 3: b1 b3. Each dot is 1 block.
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
....
  No matches were found.
(Restoring the data.)

. 
. restore, preserve

. timer99: dtalink x1 1 -1 x2 2 -2 x3 3 -3 x4 .1 -5        , cutoff(4) describe examples(16)

----------------------------------------------------------------------------
Usage type and variable  |
name                     |    Match weight  No match weight          Caliper
-------------------------+--------------------------------------------------
Blocking variables       |
                  (None) |                                                 0
-------------------------+--------------------------------------------------
Exact matching variables |
                      x1 |               1               -1                0
                      x2 |               2               -2                0
                      x3 |               3               -3                0
                      x4 |              .1               -5                0
----------------------------------------------------------------------------
  1163 matches were found.

Distribution of matched pair scores, among pairs with score >=4:

Probabilist |
ic matching |
      score |      Freq.
------------+------------+-----------------------------------------------------
       4.10 |      1,125 |*****************************************************
       6.10 |         38 |**
------------+------------+-----------------------------------------------------
      Total |      1,163 
The current configuration of the data is: one row per record.


Description of the new dataset:

Contains data
  obs:         2,973                          
 vars:            12                          
 size:        86,217                          
----------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
----------------------------------------------------------------------------------------------------------------------------------------------------------------
_matchID        int     %10.0g                Matched set identifier
_id             float   %9.0g                 Row number in original data file
_score          double  %9.2f                 Probabilistic matching score
_matchflag      byte    %11.0g     _mtchflg   Match indicator
x1              byte    %8.0g                 
x2              byte    %8.0g                 
x3              byte    %8.0g                 
x4              str6    %9s                   
b1              byte    %8.0g                 
b2              byte    %8.0g                 
b3              byte    %8.0g                 
b4              str2    %9s                   
----------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: _matchID  _id  x1  x2  x3  x4
     Note: Dataset has changed since last saved.

Examples (up to 16 rows):

      +---------------------------------------------------------------------------------+
      | _matchID    _id   _score   _match~g   x1   x2   x3       x4   b1   b2   b3   b4 |
      |---------------------------------------------------------------------------------|
   1. |        1      2     4.10    Matched    4   15    1     male    0    0    0   CA |
   2. |        1   1800     4.10    Matched    6   15    1     male    0    0    0   TX |
      |---------------------------------------------------------------------------------|
   3. |        2      3     4.10    Matched   13   11    2     male    1    0    1   TX |
   4. |        2    310     4.10    Matched   14   11    2     male    1    1    0   CA |
      |---------------------------------------------------------------------------------|
   5. |        3      3     4.10    Matched   13   11    2     male    1    0    1   TX |
   6. |        3    875     4.10    Matched    6   11    2     male    1    0    0   TX |
      |---------------------------------------------------------------------------------|
   7. |        4      5     4.10    Matched   10    1    5     male    0    0    1   CA |
   8. |        4    749     4.10    Matched   19    1    5     male    0    1    1   TX |
      |---------------------------------------------------------------------------------|
   9. |        5      6     4.10    Matched   27   23   11   female    0    1    1   TX |
  10. |        5     64     4.10    Matched    6   23   11   female    1    1    0   TX |
      |---------------------------------------------------------------------------------|
  11. |        6      6     4.10    Matched   27   23   11   female    0    1    1   TX |
  12. |        6   1015     4.10    Matched    1   23   11   female    0    1    0   CA |
      |---------------------------------------------------------------------------------|
  13. |        7      6     4.10    Matched   27   23   11   female    0    1    1   TX |
  14. |        7   1149     4.10    Matched   11   23   11   female    1    0    0   CA |
      |---------------------------------------------------------------------------------|
  15. |        8      7     4.10    Matched   14   18    4     male    1    0    0   CA |
  16. |        8    457     4.10    Matched   20   18    4     male    0    1    1   TX |
      +---------------------------------------------------------------------------------+
  Time to run = .4 sec

. 
. restore, preserve

. timer99: dtalink x1 1 -1 x2 2 -2 x3 3 -3 x4 .1 -5        , cutoff(4) block(b1 b2 | b3 | b1 b3 | b2 b4) wide describe examples(16)

----------------------------------------------------------------------------
Usage type and variable  |
name                     |    Match weight  No match weight          Caliper
-------------------------+--------------------------------------------------
Blocking variables       |
                   b1 b2 |                                                 0
                   b1 b3 |                                                 0
                   b2 b4 |                                                 0
                      b3 |                                                 0
-------------------------+--------------------------------------------------
Exact matching variables |
                      x1 |               1               -1                0
                      x2 |               2               -2                0
                      x3 |               3               -3                0
                      x4 |              .1               -5                0
----------------------------------------------------------------------------
Starting 4 blocks for blocking set 1 of 4: b1 b2. Each dot is 1 block.
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
....
Starting 2 blocks for blocking set 2 of 4: b3. Each dot is 1 block.
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..
Starting 4 blocks for blocking set 3 of 4: b1 b3. Each dot is 1 block.
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
....
Starting 4 blocks for blocking set 4 of 4: b2 b4. Each dot is 1 block.
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
....
  797 matches were found.

Distribution of matched pair scores, among pairs with score >=4:

Probabilist |
ic matching |
      score |      Freq.
------------+------------+-----------------------------------------------------
       4.10 |        769 |*****************************************************
       6.10 |         28 |**
------------+------------+-----------------------------------------------------
      Total |        797 
The current configuration of the data is: one row per matched pair.


Description of the new dataset:

Contains data
  obs:           797                          
 vars:             5                          
 size:        11,955                          
----------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
----------------------------------------------------------------------------------------------------------------------------------------------------------------
_matchID        int     %10.0g                Matched set identifier
_id0            int     %9.0g                 Row number in original data file
_id1            int     %9.0g                 Row number in original data file
_score          double  %9.2f                 Probabilistic matching score
_matchflag      byte    %11.0g     _mtchflg   Match indicator
----------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

Examples (up to 16 rows):

     +--------------------------------------------+
     | _matchID   _id0   _id1   _score   _match~g |
     |--------------------------------------------|
  1. |        1      2   1800     4.10    Matched |
     |--------------------------------------------|
  2. |        2      3    875     4.10    Matched |
     |--------------------------------------------|
  3. |        3      5    749     4.10    Matched |
     |--------------------------------------------|
  4. |        4      6     64     4.10    Matched |
  5. |        5      6   1015     4.10    Matched |
     |--------------------------------------------|
  6. |        6      7   1928     4.10    Matched |
     |--------------------------------------------|
  7. |        7      9    966     4.10    Matched |
  8. |        8      9   1435     4.10    Matched |
     |--------------------------------------------|
  9. |        9     10    906     4.10    Matched |
     |--------------------------------------------|
 10. |       10     12   1029     4.10    Matched |
     |--------------------------------------------|
 11. |       11     13    885     4.10    Matched |
     |--------------------------------------------|
 12. |       12     14   1629     4.10    Matched |
     |--------------------------------------------|
 13. |       13     15   1445     4.10    Matched |
     |--------------------------------------------|
 14. |       14     16    381     4.10    Matched |
 15. |       15     16   1310     4.10    Matched |
     |--------------------------------------------|
 16. |       16     17     70     4.10    Matched |
     +--------------------------------------------+
  Time to run = .78 sec

. 
. restore, preserve

. qui {

. dtalink `r(new_wgt_specs)'                , cutoff(2) describe examples(16) calcweights

------------------------------------------------------------------------------
Usage type and variable    |
name                       |    Match weight  No match weight          Caliper
---------------------------+--------------------------------------------------
Blocking variables         |
                    (None) |                                                 0
---------------------------+--------------------------------------------------
Caliper matching variables |
                        x3 |        2.677725        -1021.755                2
---------------------------+--------------------------------------------------
Exact matching variables   |
                        x1 |        4.047597        -.9852036                0
                        x2 |        4.042108        -.9804696                0
                        x4 |        1.007822        -1021.008                0
------------------------------------------------------------------------------
  10634 matches were found.

Suggested matching weights:
-----------------------------------------------------------------------
                           | new_wgt_match  new_wgt_no_match    Caliper
---------------------------+-------------------------------------------
Caliper_matching_variables |
                        x3 |         2.678         -1021.755      2.000
---------------------------+-------------------------------------------
Exact_matching_variables   |
                        x1 |         4.048            -0.985          .
                        x2 |         4.042            -0.980          .
                        x4 |         1.008         -1021.008          .
-----------------------------------------------------------------------

Distribution of matched pair scores, among pairs with score >=2:

Probabilist |
ic matching |
      score |      Freq.
------------+------------+-----------------------------------------------------
       6.74 |      5,206 |*****************************************************
       6.75 |      5,223 |*****************************************************
      11.78 |        205 |**
------------+------------+-----------------------------------------------------
      Total |     10,634 
The current configuration of the data is: one row per record.


Description of the new dataset:

Contains data
  obs:        21,268                          
 vars:            12                          
 size:       616,772                          
----------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
----------------------------------------------------------------------------------------------------------------------------------------------------------------
_matchID        int     %10.0g                Matched set identifier
_id             float   %9.0g                 Row number in original data file
_score          double  %9.2f                 Probabilistic matching score
_matchflag      byte    %11.0g     _mtchflg   Match indicator
x1              byte    %8.0g                 
x2              byte    %8.0g                 
x3              byte    %8.0g                 
x4              str6    %9s                   
b1              byte    %8.0g                 
b2              byte    %8.0g                 
b3              byte    %8.0g                 
b4              str2    %9s                   
----------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: _matchID  _id  x3  x1  x2  x4
     Note: Dataset has changed since last saved.

Examples (up to 16 rows):

       +---------------------------------------------------------------------------------+
       | _matchID    _id   _score   _match~g   x1   x2   x3       x4   b1   b2   b3   b4 |
       |---------------------------------------------------------------------------------|
    1. |        1      1     6.74    Matched    4   27    0   female    0    0    0   TX |
    2. |        1    428     6.74    Matched   16   27    2   female    1    1    0   TX |
       |---------------------------------------------------------------------------------|
    3. |        2      1     6.75    Matched    4   27    0   female    0    0    0   TX |
    4. |        2   1378     6.75    Matched    4   14    2   female    1    0    0   TX |
       |---------------------------------------------------------------------------------|
    5. |        3      2     6.74    Matched    4   15    1     male    0    0    0   CA |
    6. |        3    206     6.74    Matched    1   15    3     male    1    1    1   TX |
       |---------------------------------------------------------------------------------|
    7. |        4      2     6.75    Matched    4   15    1     male    0    0    0   CA |
    8. |        4    470     6.75    Matched    4   17    2     male    0    0    1   CA |
       |---------------------------------------------------------------------------------|
    9. |        5      2     6.75    Matched    4   15    1     male    0    0    0   CA |
   10. |        5    539     6.75    Matched    4    8    2     male    0    1    0   CA |
       |---------------------------------------------------------------------------------|
   11. |        6      2     6.74    Matched    4   15    1     male    0    0    0   CA |
   12. |        6    555     6.74    Matched   18   15    0     male    0    1    0   TX |
       |---------------------------------------------------------------------------------|
   13. |        7      2     6.75    Matched    4   15    1     male    0    0    0   CA |
   14. |        7   1248     6.75    Matched    4   19    2     male    1    0    0   CA |
       |---------------------------------------------------------------------------------|
   15. |        8      2     6.75    Matched    4   15    1     male    0    0    0   CA |
   16. |        8   1631     6.75    Matched    4   13    2     male    1    0    1   CA |
       +---------------------------------------------------------------------------------+

. return list

scalars:
         r(scores_max) =  11.775252
         r(scores_min) =  6.7424514
          r(scores_sd) =  .691355410920888
        r(scores_mean) =  6.844493797216476
           r(pairsnum) =  10634
                  r(N) =  2000
          r(misscheck) =  1
             r(cutoff) =  2
           r(numfiles) =  1

macros:
      r(new_wgt_specs) : "x1 4.047597 -.9852036 x2 4.042108 -.9804696 x4 1.007822 -1021.008 x3 2.677725 -1021.755 2"
          r(dstnegwgt) : "-1021.755"
          r(dstposwgt) : "2.677725"
           r(dstradii) : "2"
            r(dstvars) : "x3"
          r(mtcnegwgt) : "-.9852036 -.9804696 -1021.008"
          r(mtcposwgt) : "4.047597 4.042108 1.007822"
            r(mtcvars) : "x1 x2 x4"
            r(cmdline) : "dtalink x1 4.047597 -.9852036 x2 4.042108 -.9804696 x4 1.007822 -1021.008 x3 2.677725 -1021.755 2                , cutoff(2) descr.."
                r(cmd) : "dtalink"

matrices:
        r(new_weights) :  4 x 3
     r(new_dst_negwgt) :  1 x 1
     r(new_dst_poswgt) :  1 x 1
     r(new_mtc_negwgt) :  3 x 1
     r(new_mtc_poswgt) :  3 x 1

. 
. * ----------- with missing data ----------
. restore

. replace x1=. in 1/2
(2 real changes made, 2 to missing)

. replace x2=. in 2/3
(2 real changes made, 2 to missing)

. set seed 2

. replace x1=. if runiform()<.05
(96 real changes made, 96 to missing)

. replace x2=. if runiform()<.05
(103 real changes made, 103 to missing)

. 
. preserve

. dtalink x1 1 -1 x2 2 -2 x3 3 -3 x4 .1 -2 in 1/10, cutoff(0) merge describe examples(16)

----------------------------------------------------------------------------
Usage type and variable  |
name                     |    Match weight  No match weight          Caliper
-------------------------+--------------------------------------------------
Blocking variables       |
                  (None) |                                                 0
-------------------------+--------------------------------------------------
Exact matching variables |
                      x1 |               1               -1                0
                      x2 |               2               -2                0
                      x3 |               3               -3                0
                      x4 |              .1               -2                0
----------------------------------------------------------------------------
  No matches were found.
(Restoring the data.)

. restore

. timer99: dtalink x1 1 -1 x2 2 -2 x3 3 -3        , cutoff(4) merge describe examples(16)

----------------------------------------------------------------------------
Usage type and variable  |
name                     |    Match weight  No match weight          Caliper
-------------------------+--------------------------------------------------
Blocking variables       |
                  (None) |                                                 0
-------------------------+--------------------------------------------------
Exact matching variables |
                      x1 |               1               -1                0
                      x2 |               2               -2                0
                      x3 |               3               -3                0
----------------------------------------------------------------------------
  2268 matches were found.

Distribution of matched pair scores, among pairs with score >=4:

Probabilist |
ic matching |
      score |      Freq.
------------+------------+-----------------------------------------------------
       4.00 |      2,002 |*****************************************************
       5.00 |        209 |******
       6.00 |         57 |**
------------+------------+-----------------------------------------------------
      Total |      2,268 
The current configuration of the data is: one row per record.


Description of the new dataset:

Contains data
  obs:         4,747                          
 vars:            12                          
 size:       104,434                          
----------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
----------------------------------------------------------------------------------------------------------------------------------------------------------------
_matchID        int     %10.0g                Matched set identifier
_id             float   %9.0g                 Row number in original data file
_score          byte    %9.2f                 Probabilistic matching score
_matchflag      byte    %11.0g     _mtchflg   Match indicator
x1              byte    %8.0g                 
x2              byte    %8.0g                 
x3              byte    %8.0g                 
x4              str6    %9s                   
b1              byte    %8.0g                 
b2              byte    %8.0g                 
b3              byte    %8.0g                 
b4              str2    %9s                   
----------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: _matchID  _id  x1  x2  x3
     Note: Dataset has changed since last saved.

Examples (up to 16 rows):

      +---------------------------------------------------------------------------------+
      | _matchID    _id   _score   _match~g   x1   x2   x3       x4   b1   b2   b3   b4 |
      |---------------------------------------------------------------------------------|
   1. |        1      3     4.00    Matched   13    .    2     male    1    0    1   TX |
   2. |        1    856     4.00    Matched   13   20    2   female    1    0    0   CA |
      |---------------------------------------------------------------------------------|
   3. |        2      3     4.00    Matched   13    .    2     male    1    0    1   TX |
   4. |        2   1357     4.00    Matched   13   15    2   female    1    0    1   TX |
      |---------------------------------------------------------------------------------|
   5. |        3      4     4.00    Matched    0   18   22     male    1    1    0   CA |
   6. |        3    315     4.00    Matched    6   18   22   female    1    0    1   TX |
      |---------------------------------------------------------------------------------|
   7. |        4      4     4.00    Matched    0   18   22     male    1    1    0   CA |
   8. |        4   1332     4.00    Matched   24   18   22   female    0    1    1   TX |
      |---------------------------------------------------------------------------------|
   9. |        5      4     4.00    Matched    0   18   22     male    1    1    0   CA |
  10. |        5   1403     4.00    Matched   17   18   22   female    1    1    0   TX |
      |---------------------------------------------------------------------------------|
  11. |        6      5     4.00    Matched   10    1    5     male    0    0    1   CA |
  12. |        6    749     4.00    Matched   19    1    5     male    0    1    1   TX |
      |---------------------------------------------------------------------------------|
  13. |        7      5     4.00    Matched   10    1    5     male    0    0    1   CA |
  14. |        7   1366     4.00    Matched   27    1    5   female    0    0    0   TX |
      |---------------------------------------------------------------------------------|
  15. |        8      5     4.00    Matched   10    1    5     male    0    0    1   CA |
  16. |        8   1421     4.00    Matched   24    1    5   female    1    0    1   CA |
      +---------------------------------------------------------------------------------+
  Time to run = .51 sec

. 
. 
. * ----------- Wide example dataset ----------
. clear

. set seed 3

. set obs 2000
number of observations (_N) was 0, now 2,000

. forvalues k = 1/500 {
  2.  gen int var`k'=floor(runiform(0,10))
  3.  if `k' <= 100 local v1_100 `v1_100' var`k' 1 0
  4.  local v1_500 `v1_500' var`k' 1 0
  5. }

. qui compress

. 
. preserve

. dtalink `v1_100', cutoff(20) noweighttable wide describe examples(16)
  3995 matches were found.

Distribution of matched pair scores, among pairs with score >=20:

Probabilist |
ic matching |
      score |      Freq.
------------+------------+-----------------------------------------------------
      20.00 |      2,377 |*****************************************************
      21.00 |        987 |**********************
      22.00 |        394 |*********
      23.00 |        146 |***
      24.00 |         62 |*
      25.00 |         17 |
      26.00 |          9 |
      28.00 |          3 |
------------+------------+-----------------------------------------------------
      Total |      3,995 
The current configuration of the data is: one row per matched pair.


Description of the new dataset:

Contains data
  obs:         3,995                          
 vars:             5                          
 size:        31,960                          
----------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
----------------------------------------------------------------------------------------------------------------------------------------------------------------
_matchID        int     %10.0g                Matched set identifier
_id0            int     %9.0g                 Row number in original data file
_id1            int     %9.0g                 Row number in original data file
_score          byte    %9.2f                 Probabilistic matching score
_matchflag      byte    %11.0g     _mtchflg   Match indicator
----------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

Examples (up to 16 rows):

      +--------------------------------------------+
      | _matchID   _id0   _id1   _score   _match~g |
      |--------------------------------------------|
   1. |        1      1    205    21.00    Matched |
   2. |        2      1   1317    20.00    Matched |
   3. |        3      1   1338    20.00    Matched |
   4. |        4      1   1766    21.00    Matched |
   5. |        5      1   1783    20.00    Matched |
      |--------------------------------------------|
   6. |        6      2    502    21.00    Matched |
   7. |        7      2    629    20.00    Matched |
      |--------------------------------------------|
   8. |        8      3    361    22.00    Matched |
   9. |        9      3    560    20.00    Matched |
  10. |       10      3    762    21.00    Matched |
      |--------------------------------------------|
  11. |       11      4    462    20.00    Matched |
  12. |       12      4   1411    21.00    Matched |
      |--------------------------------------------|
  13. |       13      5    356    20.00    Matched |
  14. |       14      5    788    20.00    Matched |
  15. |       15      5    845    22.00    Matched |
      |--------------------------------------------|
  16. |       16      6    923    20.00    Matched |
      +--------------------------------------------+

. 
. restore

. timer99: dtalink `v1_500', cutoff(20) noweighttable wide describe examples(16)
  1998999 matches were found.

Distribution of matched pair scores, among pairs with score >=20:

                Probabilistic matching score
-------------------------------------------------------------
      Percentiles      Smallest
 1%           35             21
 5%           39             22
10%           41             22       Obs           1,998,999
25%           45             22       Sum of Wgt.   1,998,999

50%           50                      Mean           50.00037
                        Largest       Std. Dev.      6.712388
75%           54             83
90%           59             83       Variance       45.05616
95%           61             84       Skewness       .1180431
99%           66             84       Kurtosis       3.010388
The current configuration of the data is: one row per matched pair.


Description of the new dataset:

Contains data
  obs:     1,998,999                          
 vars:             5                          
 size:    19,989,990                          
----------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
----------------------------------------------------------------------------------------------------------------------------------------------------------------
_matchID        long    %10.0g                Matched set identifier
_id0            int     %9.0g                 Row number in original data file
_id1            int     %9.0g                 Row number in original data file
_score          byte    %9.2f                 Probabilistic matching score
_matchflag      byte    %11.0g     _mtchflg   Match indicator
----------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

Examples (up to 16 rows):

         +--------------------------------------------+
         | _matchID   _id0   _id1   _score   _match~g |
         |--------------------------------------------|
      1. |        1      1      2    66.00    Matched |
      2. |        2      1      3    41.00    Matched |
      3. |        3      1      4    45.00    Matched |
      4. |        4      1      5    58.00    Matched |
      5. |        5      1      6    46.00    Matched |
      6. |        6      1      7    55.00    Matched |
      7. |        7      1      8    37.00    Matched |
      8. |        8      1      9    62.00    Matched |
      9. |        9      1     10    43.00    Matched |
     10. |       10      1     11    57.00    Matched |
     11. |       11      1     12    55.00    Matched |
     12. |       12      1     13    62.00    Matched |
     13. |       13      1     14    46.00    Matched |
     14. |       14      1     15    50.00    Matched |
     15. |       15      1     16    51.00    Matched |
     16. |       16      1     17    49.00    Matched |
         +--------------------------------------------+
  Time to run = 17.58 sec

. 
. * ----------- Lots of blocks example ----------
. clear

. set seed 4

. set obs 50000
number of observations (_N) was 0, now 50,000

. forvalues k = 1/10 {
  2.   gen var`k'=floor(runiform(0,20))
  3.   local v1_k `v1_k' var`k' 1 0
  4.   if `k'>4 continue
  5.   gen blk`k' = floor(runiform(0,10000))
  6. }

. qui compress

. gen f = runiform()<.5

. gen g = floor(runiform(0,10))

. gen dob = floor(runiform(0,400))

. sort f g dob

. 
. preserve

. timer99: dtalink `v1_k' , cutoff(5) block(blk1 | blk2 | blk3 | f) wide describe

----------------------------------------------------------------------------
Usage type and variable  |
name                     |    Match weight  No match weight          Caliper
-------------------------+--------------------------------------------------
Blocking variables       |
                    blk1 |                                                 0
                    blk2 |                                                 0
                    blk3 |                                                 0
                       f |                                                 0
-------------------------+--------------------------------------------------
Exact matching variables |
                    var1 |               1                0                0
                   var10 |               1                0                0
                    var2 |               1                0                0
                    var3 |               1                0                0
                    var4 |               1                0                0
                    var5 |               1                0                0
                    var6 |               1                0                0
                    var7 |               1                0                0
                    var8 |               1                0                0
                    var9 |               1                0                0
----------------------------------------------------------------------------
Starting 9595 blocks for blocking set 1 of 4: blk1. Each dot is 100 blocks (95 dots total).
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
.............................................
Starting 9560 blocks for blocking set 2 of 4: blk2. Each dot is 100 blocks (95 dots total).
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
.............................................
Starting 9591 blocks for blocking set 3 of 4: blk3. Each dot is 100 blocks (95 dots total).
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
.............................................
Starting 2 blocks for blocking set 4 of 4: f. Each dot is 1 block.
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..
  39706 matches were found.

Distribution of matched pair scores, among pairs with score >=5:

Probabilist |
ic matching |
      score |      Freq.
------------+------------+-----------------------------------------------------
       5.00 |     38,032 |*****************************************************
       6.00 |      1,628 |**
       7.00 |         46 |
------------+------------+-----------------------------------------------------
      Total |     39,706 
The current configuration of the data is: one row per matched pair.


Description of the new dataset:

Contains data
  obs:        39,706                          
 vars:             5                          
 size:       555,884                          
----------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
----------------------------------------------------------------------------------------------------------------------------------------------------------------
_matchID        long    %10.0g                Matched set identifier
_id0            float   %9.0g                 Row number in original data file
_id1            float   %9.0g                 Row number in original data file
_score          byte    %9.2f                 Probabilistic matching score
_matchflag      byte    %11.0g     _mtchflg   Match indicator
----------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
  Time to run = 68.98 sec

. 
. restore, preserve

. timer99: dtalink `v1_k' , cutoff(5) block(blk1 | blk2 | blk3) source(f) wide describe

----------------------------------------------------------------------------
Usage type and variable  |
name                     |    Match weight  No match weight          Caliper
-------------------------+--------------------------------------------------
Blocking variables       |
                    blk1 |                                                 0
                    blk2 |                                                 0
                    blk3 |                                                 0
-------------------------+--------------------------------------------------
Exact matching variables |
                    var1 |               1                0                0
                   var10 |               1                0                0
                    var2 |               1                0                0
                    var3 |               1                0                0
                    var4 |               1                0                0
                    var5 |               1                0                0
                    var6 |               1                0                0
                    var7 |               1                0                0
                    var8 |               1                0                0
                    var9 |               1                0                0
----------------------------------------------------------------------------
Starting 8461 blocks for blocking set 1 of 3: blk1. Each dot is 100 blocks (84 dots total).
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................
Starting 8381 blocks for blocking set 2 of 3: blk2. Each dot is 100 blocks (83 dots total).
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
.................................
Starting 8425 blocks for blocking set 3 of 3: blk3. Each dot is 100 blocks (84 dots total).
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................
  12 matches were found.

Distribution of matched pair scores, among pairs with score >=5:

Probabilist |
ic matching |
      score |      Freq.
------------+------------+-----------------------------------------------------
       5.00 |         12 |************
------------+------------+-----------------------------------------------------
      Total |         12 
The current configuration of the data is: one row per matched pair.


Description of the new dataset:

Contains data
  obs:            12                          
 vars:             5                          
 size:           132                          
----------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
----------------------------------------------------------------------------------------------------------------------------------------------------------------
_matchID        byte    %10.0g                Matched set identifier
_id0            float   %9.0g                 Row number in original data file
_id1            float   %9.0g                 Row number in original data file
_score          byte    %9.2f                 Probabilistic matching score
_matchflag      byte    %11.0g     _mtchflg   Match indicator
----------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
  Time to run = 1.06 sec

. 
. restore, preserve

. timer99: dtalink `v1_k' dob 20 0 30 dob 10 -5 365 , cutoff(5) block(blk1 | blk2 | blk3 ) noweighttable
Starting 9595 blocks for blocking set 1 of 3: blk1. Each dot is 100 blocks (95 dots total).
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
.............................................
Starting 9560 blocks for blocking set 2 of 3: blk2. Each dot is 100 blocks (95 dots total).
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
.............................................
Starting 9591 blocks for blocking set 3 of 3: blk3. Each dot is 100 blocks (95 dots total).
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
.............................................
  371572 matches were found.

Distribution of matched pair scores, among pairs with score >=5:

Probabilist |
ic matching |
      score |      Freq.
------------+------------+-----------------------------------------------------
      10.00 |    189,683 |*****************************************************
      11.00 |     99,542 |****************************
      12.00 |     23,477 |*******
      13.00 |      3,389 |*
      14.00 |        304 |
      15.00 |         25 |
      30.00 |     33,063 |*********
      31.00 |     17,291 |*****
      32.00 |      4,187 |*
      33.00 |        537 |
      34.00 |         73 |
      35.00 |          1 |
------------+------------+-----------------------------------------------------
      Total |    371,572 
The current configuration of the data is: one row per record.
  Time to run = 5.49 sec

. 
. // audit scores to see if I'm getting right results
. bys _score _matchID (_id) : gen diff = abs(dob[1]-dob[_N])

. by  _score _matchID (_id) : gen scoreE = (var1[1]==var1[_N])+(var2[1]==var2[_N])+(var3[1]==var3[_N])+(var4[1]==var4[_N])+(var5[1]==var5[_N])+(var6[1]==var6[_N
> ])+(var7[1]==var7[_N])+(var8[1]==var8[_N])+(var9[1]==var9[_N])+(var10[1]==var10[_N])

. by  _score _matchID (_id) : gen scoreD = cond(diff<=30, 30, cond(diff<=365, 10, -5))

. gen score = scoreE + scoreD

. by  _score _matchID (_id) : gen s1 = (_n==1 * runiform()<.00002)

. by  _score _matchID (_id) : egen s2 = max(s1)

. count if s2
  8

. // list  _* dob diff-score if s2 | score!=_score, sepby(_matchID) noobs
. assert score==_score

. 
. restore, preserve

. timer99: dtalink `v1_k' dob 20 0 30 dob 10 -5 365 , cutoff(5) block(blk1 | blk2 | blk3 ) wide noweighttable source(f)
Starting 8461 blocks for blocking set 1 of 3: blk1. Each dot is 100 blocks (84 dots total).
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................
Starting 8381 blocks for blocking set 2 of 3: blk2. Each dot is 100 blocks (83 dots total).
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
.................................
Starting 8425 blocks for blocking set 3 of 3: blk3. Each dot is 100 blocks (84 dots total).
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................
  185763 matches were found.

Distribution of matched pair scores, among pairs with score >=5:

Probabilist |
ic matching |
      score |      Freq.
------------+------------+-----------------------------------------------------
      10.00 |     95,006 |*****************************************************
      11.00 |     49,648 |****************************
      12.00 |     11,741 |*******
      13.00 |      1,676 |*
      14.00 |        161 |
      15.00 |         11 |
      30.00 |     16,524 |*********
      31.00 |      8,551 |*****
      32.00 |      2,140 |*
      33.00 |        264 |
      34.00 |         40 |
      35.00 |          1 |
------------+------------+-----------------------------------------------------
      Total |    185,763 
The current configuration of the data is: one row per matched pair.
  Time to run = 1.41 sec

. 
. // the first dtalink example above takes so long because the variable f makes huge blocks. See, this takes almost as long:
. restore, preserve

. timer99: dtalink `v1_k', cutoff(5) block(f) wide describe

----------------------------------------------------------------------------
Usage type and variable  |
name                     |    Match weight  No match weight          Caliper
-------------------------+--------------------------------------------------
Blocking variables       |
                       f |                                                 0
-------------------------+--------------------------------------------------
Exact matching variables |
                    var1 |               1                0                0
                   var10 |               1                0                0
                    var2 |               1                0                0
                    var3 |               1                0                0
                    var4 |               1                0                0
                    var5 |               1                0                0
                    var6 |               1                0                0
                    var7 |               1                0                0
                    var8 |               1                0                0
                    var9 |               1                0                0
----------------------------------------------------------------------------
Starting 2 blocks for blocking set 1 of 1: f. Each dot is 1 block.
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..
  39694 matches were found.

Distribution of matched pair scores, among pairs with score >=5:

Probabilist |
ic matching |
      score |      Freq.
------------+------------+-----------------------------------------------------
       5.00 |     38,020 |*****************************************************
       6.00 |      1,628 |**
       7.00 |         46 |
------------+------------+-----------------------------------------------------
      Total |     39,694 
The current configuration of the data is: one row per matched pair.


Description of the new dataset:

Contains data
  obs:        39,694                          
 vars:             5                          
 size:       555,716                          
----------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
----------------------------------------------------------------------------------------------------------------------------------------------------------------
_matchID        long    %10.0g                Matched set identifier
_id0            float   %9.0g                 Row number in original data file
_id1            float   %9.0g                 Row number in original data file
_score          byte    %9.2f                 Probabilistic matching score
_matchflag      byte    %11.0g     _mtchflg   Match indicator
----------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.
  Time to run = 64.25 sec

. 
. // when you only have one block, the parallel prefix might speed things up:
. restore, preserve

. cap nois {
.   parallel setclusters 2
N Child processes: 2
Stata dir:  C:\Program Files (x86)\Stata15/StataMP-64.exe
.   timer99: ///
>   parallel, by(f) processors(2):  dtalink `v1_k', cutoff(5) wide
--------------------------------------------------------------------------------
Parallel Computing with Stata
Child processes: 2
pll_id         : 95k6tdo2l3
Running at     : C:\Users\kkranker\Documents\Stata\dtalink\code-dtalink
Randtype       : datetime
Waiting for the child processes to finish...
child process 0002 has exited without error...
child process 0001 has exited without error...
--------------------------------------------------------------------------------
Enter -parallel printlog #- to checkout logfiles.
--------------------------------------------------------------------------------
  Time to run = 48.09 sec
.   tab  _score, plot

Probabilist |
ic matching |
      score |      Freq.
------------+------------+-----------------------------------------------------
       5.00 |     38,020 |*****************************************************
       6.00 |      1,628 |**
       7.00 |         46 |
------------+------------+-----------------------------------------------------
      Total |     39,694 
. }

. 
. // EM example
. restore, preserve

. di as input "`v1_k'"
var1 1 0 var2 1 0 var3 1 0 var4 1 0 var5 1 0 var6 1 0 var7 1 0 var8 1 0 var9 1 0 var10 1 0

. dtalink `v1_k' dob 20 0 30 dob 10 -5 365 , cutoff(5) block(blk1 | blk2 | blk3 ) wide noweighttable calcweights
Starting 9595 blocks for blocking set 1 of 3: blk1. Each dot is 100 blocks (95 dots total).
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
.............................................
Starting 9560 blocks for blocking set 2 of 3: blk2. Each dot is 100 blocks (95 dots total).
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
.............................................
Starting 9591 blocks for blocking set 3 of 3: blk3. Each dot is 100 blocks (95 dots total).
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
.............................................
  371572 matches were found.

Suggested matching weights:
-----------------------------------------------------------------------
                           | new_wgt_match  new_wgt_no_match    Caliper
---------------------------+-------------------------------------------
Caliper_matching_variables |
                       dob |      1019.248            -0.232     30.000
                       dob |      1022.000         -1022.000    365.000
---------------------------+-------------------------------------------
Exact_matching_variables   |
                      var1 |         0.000             0.000          .
                      var2 |         0.053            -0.003          .
                      var3 |         0.134            -0.007          .
                      var4 |         0.000             0.000          .
                      var5 |         0.028            -0.001          .
                      var6 |         0.265            -0.013          .
                      var7 |         0.213            -0.010          .
                      var8 |         0.000             0.000          .
                      var9 |         0.074            -0.004          .
                     var10 |         0.000             0.000          .
-----------------------------------------------------------------------

Distribution of matched pair scores, among pairs with score >=5:

Probabilist |
ic matching |
      score |      Freq.
------------+------------+-----------------------------------------------------
      10.00 |    189,683 |*****************************************************
      11.00 |     99,542 |****************************
      12.00 |     23,477 |*******
      13.00 |      3,389 |*
      14.00 |        304 |
      15.00 |         25 |
      30.00 |     33,063 |*********
      31.00 |     17,291 |*****
      32.00 |      4,187 |*
      33.00 |        537 |
      34.00 |         73 |
      35.00 |          1 |
------------+------------+-----------------------------------------------------
      Total |    371,572 
The current configuration of the data is: one row per matched pair.

. di as input =r(new_wgt_specs)
var1 0 0 var2 .0527341 -.0027017 var3 .1342802 -.0067659 var4 0 0 var5 .0275355 -.0014404 var6 .2645786 -.0126629 var7 .2131012 -.0102669 var8 0 0 var9 .0740583
>  -.0037949 var10 0 0 dob 1019.248 -.2318018 30 dob 1022 -1022 365

. restore, preserve

. dtalink `r(new_wgt_specs)', cutoff(5) block(blk1 | blk2 | blk3 ) wide noweighttable calcweights
Starting 9595 blocks for blocking set 1 of 3: blk1. Each dot is 100 blocks (95 dots total).
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
.............................................
Starting 9560 blocks for blocking set 2 of 3: blk2. Each dot is 100 blocks (95 dots total).
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
.............................................
Starting 9591 blocks for blocking set 3 of 3: blk3. Each dot is 100 blocks (95 dots total).
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
.............................................
  371572 matches were found.

Suggested matching weights:
-----------------------------------------------------------------------
                           | new_wgt_match  new_wgt_no_match    Caliper
---------------------------+-------------------------------------------
Caliper_matching_variables |
                       dob |      1019.248            -0.232     30.000
                       dob |      1022.000         -1022.000    365.000
---------------------------+-------------------------------------------
Exact_matching_variables   |
                      var1 |         0.000             0.000          .
                      var2 |         0.053            -0.003          .
                      var3 |         0.134            -0.007          .
                      var4 |         0.000             0.000          .
                      var5 |         0.028            -0.001          .
                      var6 |         0.265            -0.013          .
                      var7 |         0.213            -0.010          .
                      var8 |         0.000             0.000          .
                      var9 |         0.074            -0.004          .
                     var10 |         0.000             0.000          .
-----------------------------------------------------------------------

Distribution of matched pair scores, among pairs with score >=5:

                Probabilistic matching score
-------------------------------------------------------------
      Percentiles      Smallest
 1%     1021.731       1021.731
 5%     1021.731       1021.731
10%     1021.731       1021.731       Obs             371,572
25%     1021.731       1021.731       Sum of Wgt.     371,572

50%     1021.731                      Mean           1173.091
                        Largest       Std. Dev.      362.4508
75%     1021.872       2041.852
90%      2041.21       2041.852       Variance       131370.5
95%      2041.21       2041.852       Skewness        1.97776
99%     2041.434        2041.93       Kurtosis       4.911535
The current configuration of the data is: one row per matched pair.

. restore, preserve

. di as input =r(new_wgt_specs)
var1 0 0 var2 .0527341 -.0027017 var3 .1342802 -.0067659 var4 0 0 var5 .0275355 -.0014404 var6 .2645786 -.0126629 var7 .2131012 -.0102669 var8 0 0 var9 .0740583
>  -.0037949 var10 0 0 dob 1019.248 -.2318018 30 dob 1022 -1022 365

. dtalink `r(new_wgt_specs)', cutoff(5) block(blk1 | blk2 | blk3 ) wide noweighttable calcweights
Starting 9595 blocks for blocking set 1 of 3: blk1. Each dot is 100 blocks (95 dots total).
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
.............................................
Starting 9560 blocks for blocking set 2 of 3: blk2. Each dot is 100 blocks (95 dots total).
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
.............................................
Starting 9591 blocks for blocking set 3 of 3: blk3. Each dot is 100 blocks (95 dots total).
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
.............................................
  371572 matches were found.

Suggested matching weights:
-----------------------------------------------------------------------
                           | new_wgt_match  new_wgt_no_match    Caliper
---------------------------+-------------------------------------------
Caliper_matching_variables |
                       dob |      1019.248            -0.232     30.000
                       dob |      1022.000         -1022.000    365.000
---------------------------+-------------------------------------------
Exact_matching_variables   |
                      var1 |         0.000             0.000          .
                      var2 |         0.053            -0.003          .
                      var3 |         0.134            -0.007          .
                      var4 |         0.000             0.000          .
                      var5 |         0.028            -0.001          .
                      var6 |         0.265            -0.013          .
                      var7 |         0.213            -0.010          .
                      var8 |         0.000             0.000          .
                      var9 |         0.074            -0.004          .
                     var10 |         0.000             0.000          .
-----------------------------------------------------------------------

Distribution of matched pair scores, among pairs with score >=5:

                Probabilistic matching score
-------------------------------------------------------------
      Percentiles      Smallest
 1%     1021.731       1021.731
 5%     1021.731       1021.731
10%     1021.731       1021.731       Obs             371,572
25%     1021.731       1021.731       Sum of Wgt.     371,572

50%     1021.731                      Mean           1173.091
                        Largest       Std. Dev.      362.4508
75%     1021.872       2041.852
90%      2041.21       2041.852       Variance       131370.5
95%      2041.21       2041.852       Skewness        1.97776
99%     2041.434        2041.93       Kurtosis       4.911535
The current configuration of the data is: one row per matched pair.

. 
. 
. restore, preserve

. di as input "`v1_k'"
var1 1 0 var2 1 0 var3 1 0 var4 1 0 var5 1 0 var6 1 0 var7 1 0 var8 1 0 var9 1 0 var10 1 0

. qui dtalink `v1_k' dob 20 0 30 dob 10 -5 365 , cutoff(5) block(blk1 | blk2 | blk3 ) wide noweighttable source(f) calcweights

. di as input =r(new_wgt_specs)
var1 1017.676 -.0738841 var2 1017.664 -.0732631 var3 1017.68 -.074113 var4 1017.686 -.0744237 var5 1017.693 -.0748162 var6 1017.668 -.0734673 var7 1017.66 -.073
> 0343 var8 1017.689 -.0745545 var9 1017.663 -.0732222 var10 1017.665 -.0733121 dob 1019.245 -.2313191 30 dob 1022 -1022 365

. restore, preserve

. qui dtalink `r(new_wgt_specs)', cutoff(5) block(blk1 | blk2 | blk3 ) wide noweighttable source(f) calcweights

. di as input =r(new_wgt_specs)
var1 1017.679 -.0740369 var2 1017.667 -.073408 var3 1017.683 -.0742412 var4 1017.69 -.0746089 var5 1017.695 -.0749195 var6 1017.669 -.0735468 var7 1017.662 -.07
> 31794 var8 1017.692 -.074756 var9 1017.667 -.0733998 var10 1017.668 -.0734488 dob 1019.244 -.2311761 30 dob 1021.999 -10.77618 365

. restore, preserve

. dtalink `r(new_wgt_specs)', cutoff(5) block(blk1 | blk2 | blk3 ) wide noweighttable source(f) calcweights
Starting 8461 blocks for blocking set 1 of 3: blk1. Each dot is 100 blocks (84 dots total).
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................
Starting 8381 blocks for blocking set 2 of 3: blk2. Each dot is 100 blocks (83 dots total).
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
.................................
Starting 8425 blocks for blocking set 3 of 3: blk3. Each dot is 100 blocks (84 dots total).
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................
  186330 matches were found.

Suggested matching weights:
-----------------------------------------------------------------------
                           | new_wgt_match  new_wgt_no_match    Caliper
---------------------------+-------------------------------------------
Caliper_matching_variables |
                       dob |      1019.241            -0.231     30.000
                       dob |      1021.996            -8.360    365.000
---------------------------+-------------------------------------------
Exact_matching_variables   |
                      var1 |      1017.683            -0.074          .
                      var2 |      1017.671            -0.074          .
                      var3 |      1017.685            -0.074          .
                      var4 |      1017.694            -0.075          .
                      var5 |      1017.699            -0.075          .
                      var6 |      1017.672            -0.074          .
                      var7 |      1017.665            -0.073          .
                      var8 |      1017.695            -0.075          .
                      var9 |      1017.670            -0.074          .
                     var10 |      1017.673            -0.074          .
-----------------------------------------------------------------------

Distribution of matched pair scores, among pairs with score >=5:

                Probabilistic matching score
-------------------------------------------------------------
      Percentiles      Smallest
 1%     1021.028       1005.988
 5%     1021.028       1005.988
10%     1021.028       1005.988       Obs             186,330
25%     1021.028       1005.988       Sum of Wgt.     186,330

50%     1021.028                      Mean           1678.272
                        Largest       Std. Dev.      790.4293
75%     2038.795       6111.534
90%     3056.533       6111.536       Variance       624778.5
95%     3058.246       6111.538       Skewness       1.123086
99%     4076.001       7129.235       Kurtosis        4.07968
The current configuration of the data is: one row per matched pair.

. 
. return list

scalars:
         r(scores_max) =  7129.235014100001
         r(scores_min) =  1005.988278
          r(scores_sd) =  790.4293115861628
        r(scores_mean) =  1678.271996168664
           r(pairsnum) =  186330
                 r(N1) =  25096
                 r(N0) =  24904
          r(misscheck) =  1
             r(cutoff) =  5
           r(numfiles) =  2

macros:
      r(new_wgt_specs) : "var1 1017.683 -.0742565 var2 1017.671 -.0736209 var3 1017.685 -.0743788 var4 1017.694 -.0748272 var5 1017.699 -.0751289 var6 1017..."
          r(blockvars) : "blk1 | blk2 | blk3"
          r(dstnegwgt) : "-.2311761 -10.77618"
          r(dstposwgt) : "1019.244 1021.999"
           r(dstradii) : "30 365"
            r(dstvars) : "dob dob"
          r(mtcnegwgt) : "-.0740369 -.073408 -.0742412 -.0746089 -.0749195 -.0735468 -.0731794 -.074756 -.0733998 -.0734488"
          r(mtcposwgt) : "1017.679 1017.667 1017.683 1017.69 1017.695 1017.669 1017.662 1017.692 1017.667 1017.668"
            r(mtcvars) : "var1 var2 var3 var4 var5 var6 var7 var8 var9 var10"
            r(cmdline) : "dtalink var1 1017.679 -.0740369 var2 1017.667 -.073408 var3 1017.683 -.0742412 var4 1017.69 -.0746089 var5 1017.695 -.0749195 var6.."
                r(cmd) : "dtalink"

matrices:
        r(new_weights) :  12 x 3
     r(new_dst_negwgt) :  2 x 1
     r(new_dst_poswgt) :  2 x 1
     r(new_mtc_negwgt) :  10 x 1
     r(new_mtc_poswgt) :  10 x 1

. 
. log close dtalink_example
      name:  dtalink_example
       log:  C:\Users\kkranker\Documents\Stata\dtalink\code-dtalink\dtalink_example.log
  log type:  text
 closed on:   9 Sep 2019, 16:51:29
----------------------------------------------------------------------------------------------------------------------------------------------------------------
